#!/usr/bin/python
# -*- coding: utf-8 -*-

##########################################################################
#                                                                        #
# The MIT License (MIT)                                                  #
#                                                                        #
# Copyright (c) 2016-2017 Polyvios Pratikakis <polyvios@gmail.com>       #
#                                                                        #
# Permission is hereby granted, free of charge, to any person            #
# obtaining a copy of this software and associated documentation files   #
# (the "Software"), to deal in the Software without restriction,         #
# including without limitation the rights to use, copy, modify, merge,   #
# publish, distribute, sublicense, and/or sell copies of the Software,   #
# and to permit persons to whom the Software is furnished to do so,      #
# subject to the following conditions:                                   #
#                                                                        #
# The above copyright notice and this permission notice shall be         #
# included in all copies or substantial portions of the Software.        #
#                                                                        #
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,        #
# EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF     #
# MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND                  #
# NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE #
# LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION #
# OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION  #
# WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.        #
##########################################################################

###
# Greek word conjugation and declination
#
# @author Polyvios Pratikakis <polyvios@gmail.com>
#
# This python script parses elwiktionary data dumps and creates a
# graph/forest of words, where all conjugations/declinations point to the
# root form.
#

import re
import codecs
import optparse
import xmltodict
from sets import Set
from collections import defaultdict
#from cPickle import dump as pickle_dump, load as pickle_load
import json

# Wrapper object for wiktionary data
# Apply it to a word to get the "root" form.
# Use get_pos to get all part-of-speech tags that apply to the word.
# Part of speech tags may need inter-word analysis to single down to 1
# meaning.
# Use like this:
'''
from greekdict import WikiWordGraph
word_graph = WikiWordGraph('word_graph.json')
nominative = word_graph[u'νερών']
pos = word_graph.get_pos(u'νερών')
# nominative = ['νερό']
# pos = [[γενική, πληθυντικός, ουδ], Ουσ]
'''

class WikiWordGraph(object):
  def __init__(self, word_graph_filename):
    with open(word_graph_filename, 'rb') as f:
      self.word_graph, self.part_of_speech = json.load(f)
    self.words = [x for x in self.word_graph.keys()]
    self.accnt = {}
    for v in self.words:
      k = deaccent(v)
      self.accnt[k] = self.accnt.get(k, [])
      self.accnt[k].append(v)
  def get_pos(self, word):
    if word in self.part_of_speech: 
      return self.part_of_speech[word]
    if word.lower() in self.part_of_speech:
      return self.part_of_speech[word.lower()]
    k = deaccent(word)
    if k in self.accnt: return [x for y in self.accnt[k] for x in self.part_of_speech.get(y, [])]
    return []
  def __getitem__(self, word):
    if word in self.word_graph: return self.word_graph[word]
    if word.lower() in self.word_graph: return self.word_graph[word.lower()]
    k = deaccent(word)
    if k in self.accnt: return [x for y in self.accnt[k] for x in self.word_graph[y]]
    # TODO: use nltk word similarity and word context to find mis-spelled words too?
    #if bigram_fit(word) 
    return []
  def get(self, word):
    return self[word]


# Graph Builder Code
# Use with a greek wiktionary monthly dump
# Last tested with dump from January 2017

greek_letters = u'ΑΒΓΔΕΖΗΘΙΚΛΜΝΞΟΠΡΣΤΥΦΧΥΩαβγδεζηθικλμνξοπρστυφχψωΆάΈέΉήΊίΪϊΐΌόΎύϋϋΰΏώ'

deaccent_bigrams = {
  u'αί' : u'αι',
  u'άι' : u'αϊ',
  u'Άι' : u'Αϊ',
  u'άυ' : u'αϋ',
  u'Άυ' : u'Αϋ',
  u'Αί' : u'αι',
  u'Αύ' : u'Αυ',
  u'οί' : u'οι',
  u'όι' : u'οϊ',
  u'ού' : u'ου',
  u'Οί' : u'Οι',
  u'Όι' : u'Οϊ',
  u'Ού' : u'Ου',
  u'όυ' : u'οϋ',
  u'Όυ' : u'Οϋ',
  u'εί' : u'ει',
  u'έι' : u'εϊ',
  u'εύ' : u'ευ',
  u'έυ' : u'εϋ',
  u'Εί' : u'Ει',
  u'Έι' : u'Εϊ',
  u'Εύ' : u'Ευ',
  u'Έυ' : u'Εϋ'
}

accent_bigrams = {v: k for k, v in deaccent_bigrams.iteritems()}

deaccent_letters = {
  u'ά' : u'α',
  u'ἄ' : u'ἀ',
  u'Ά' : u'Α',
  u'ό' : u'ο',
  u'Ό' : u'Ο',
  u'ί' : u'ι',
  u'Ί' : u'Ι',
  u'ώ' : u'ω',
  u'Ώ' : u'Ω',
  u'ύ' : u'υ',
  u'Ύ' : u'Υ',
  u'ή' : u'η',
  u'Ή' : u'Η',
  u'έ' : u'ε',
  u'Έ' : u'Ε',
  u'ΐ' : u'ϊ',
  u'ΰ' : u'ϋ'
}

accent_letters = {v: k for k, v in deaccent_letters.iteritems()}

noun_voices = [ u'ονομαστική', u'γενική', u'αιτιατική', u'κλητική', u'ονομαστική', u'γενική', u'αιτιατική', u'κλητική'] 
noun_numbers = [ u'ενικός', u'ενικός', u'ενικός', u'ενικός', u'πληθυντικός', u'πληθυντικός', u'πληθυντικός', u'πληθυντικός' ]
#args = {
#  u'σ' : u'σ',
#  u'χμτχ' : u'σμ', #u'μ', u'μμ', u'γμ', u'-', u'υμ',
#  u'χαορ' : u'στ',
#  u'φαορ' : u'η',
#}

cases   = [ u'οριστική', u'υποτακτική', u'προστακτική', u'απαρέμφατο', u'μετοχή' ]
voices  = [ u'ενεργητική', u'παθητική' ]
#genders = [ u'αρσενικό', u'θηλυκό', u'ουδέτερο' ]
times   = [
  u'ενεστώτας',
  u'παρατατικός',
  u'αόριστος',
  u'αόριστος β',
  u'παρακείμενος',
  u'υπερσυντέλικος',
  u'συντελεσμένος μέλλοντας',
  u'εξακολουθητικός μέλλοντας', 
  u'συνοπτικός μέλλοντας'
]
persons = [ u'πρώτο', u'δεύτερο', u'τρίτο',  u'πρώτο', u'δεύτερο', u'τρίτο' ]
number = [ u'ενικός', u'ενικός', u'ενικός', u'πληθυντικός', u'πληθυντικός', u'πληθυντικός' ]

declination_list_orders = {
  u'Ουσ' : zip(noun_voices, noun_numbers),
  u'αρσ' : zip(noun_voices, noun_numbers),
  u'θηλ' : zip(noun_voices, noun_numbers),
  u'ουδ' : zip(noun_voices, noun_numbers),
  u'ενεστώτας'   : zip(persons, number),
  u'παρατατικός' : zip(persons, number),
  u'αόριστος'    : zip(persons, number),
  u'παρατατικός' : zip(persons, number),
  u'μέλλοντας'   : zip(persons, number),
  u'παθητική'    : [],
  u'ενεργητική'  : [],
}


# to find stem, remove first ending in the list
# - means after stem.
# > means accent moves to next vowel
# < means accent moves to prev vowel
# / means remove one more letter from stem
# ( means optional last letter

noun_patterns = {
  u'Αγγελική'    : { u'θηλ' : [ u'-ή', u'-ής', u'-ή', u'-ή', u'-ές', u'-ών', u'-ές', u'-ές' ] },
  u'Αφροδίτη'    : { u'θηλ' : [ u'-η', u'-ης', u'-η', u'-η', u'-ες', u'->ών', u'-ες', u'-ες' ] },
  u'Γάλλος-Γαλλίδα' : {
                     u'αρσ' : [ u'-ος', u'-ου', u'-ο', u'-ε', u'-οι', u'-ων', u'-ους', u'-οι' ],
                     u'θηλ' : [ u'-ίδα', u'-ίδας', u'-ίδα', u'-ίδα', u'-ίδες', u'-ίδων', u'-ίδες', u'-ίδες' ]
  },
  u'Γερμανός-Γερμανίδα' : {
                     u'αρσ' : [ u'-ός', u'-ού', u'-ό', u'-έ', u'-οί', u'-ών', u'-ούς', u'-οί' ],
                     u'θηλ' : [ u'-ίδα', u'-ίδας', u'-ίδα', u'-ίδα', u'-ίδες', u'-ίδων', u'-ίδες', u'-ίδες' ]
  },
  u'Μαρία'       : { u'θηλ' : [ u'-α', u'-ας', u'-α', u'-α', u'-ες', u'-ών', u'-ες', u'-ες' ] },
  u'Ρηνιώ'       : { u'θηλ' : [ u'-ώ', u'-ώς', u'-ώ', u'-ώ', u'-ές', u'-ών', u'-ές', u'-ές' ] },
  u'Σουηδός-Σουηδέζα' : {
                     u'αρσ' : [ u'-ός', u'-ού', u'-ό', u'-έ', u'-οί', u'-ών', u'-ούς', u'-οί' ],
                     u'θηλ' : [ u'-έζα', u'-έζας', u'-έζα', u'-έζα', u'-έζες', u'-έζων', u'-έζες', u'-έζες' ]
  },
  u'Φρόσω'       : { u'θηλ' : [ u'-ω', u'-ως', u'-ω', u'-ω' ] },
  u'άγγελος'     : { u'αρσ' : [ u'-ος', u'->ου', u'-ο', u'-ε', u'-οι', u'->ων', u'->ους', u'-οι' ] },
  u'αγώνας'      : { u'αρσ' : [ u'-ας', u'-α', u'-α', u'-α', u'-ες', u'-ων', u'-ες', u'-ες' ] },
  u'αιδώς'       : { u'θηλ' : [ u'-ώς', u'-ούς', u'-ώ', u'-ώς', None, None, None, None ] },
  u'αιλουροειδές': { u'ουδ' : [ u'-ές', u'-ούς', u'-ές', u'-ές', u'-ή', u'-ών', u'-ή', u'-ή' ], },
  u'αλεπού'      : { u'θηλ' : [ u'-ού', u'-ούς', u'-ού', u'-ού', u'-ούδες', u'-ούδων', u'-ούδες', u'-ούδες' ] },
  #u'αντίλαλος'   : { u'αρσ' : [ u'-ος', u'-ου', u'-ο', u'-ε', u'-οι', u'-ων', u'-ους', u'-οι' ] },
  u'αρνάκι'      : { u'ουδ' : [ u'-άκι', None  , u'-άκι', u'-άκι', u'-άκια', None, u'-άκια', u'-άκια' ] },
  u'αφέντης'     : { u'αρσ' : [ u'-ης', u'-η', u'-η', u'-η', [ u'-άδες', u'-ες' ], [ u'-άδων', u'-ών' ], [ u'-άδες', u'-ες' ], [ u'-άδες', u'-ες' ] ] },
  u'βιασύνη'     : { u'θηλ' : [ u'-η', u'-ης', u'-η', u'-η', u'-ες', u'-ων', u'-ες', u'-ες' ] },
  u'βουνό'       : { u'ουδ' : [ u'-ό', u'-ού', u'-ό', u'-ό', u'-ά', u'-ών', u'-ά', u'-ά' ] },
  u'βράδυ'       : { u'ουδ' : [ u'-υ', u'-ιού', u'-υ', u'-υ', u'-ια', u'-ιών', u'-ια', u'-ια' ] },
  u'γέρος'       : { u'αρσ' : [ u'-ος', u'-ου', u'-ο', u'-ο', u'-οι', u'-ων', u'-ους', u'-οι' ] },
  u'γιαγιά'      : { u'θηλ' : [ u'-ά', u'-άς', u'-ά', u'-ά', [ u'-ές', u'-άδες' ], [ u'-ών', u'-άδων' ], [ u'-ές', u'-άδες' ], [ u'-ές', u'-άδες' ] ] },
  u'γυαλάκιας'   : { u'αρσ' : [ u'-ας', u'-α', u'-α', u'-α', u'-ηδες', u'-ηδων', u'-ηδες', u'-ηδες' ] },
  u'δέσιμο'      : { u'ουδ' : [ u'-ο', u'->ατος', u'-ο', u'-ο', u'-ατα', u'-άτων', u'-ατα', u'-ατα' ] },
  u'διάμετρος'   : { u'θηλ' : [ u'-ος', u'->ου', u'-ο', u'-ο', u'-οι', u'->ων', u'->ους', u'-οι' ] },
  u'διδάκτωρ'    : { u'αρσ' : [ u'-ωρ', u'-ορος', u'-ορα', u'-ορ', u'-ορες', u'-όρων', u'-ορες', u'-ορες' ] },
  u'δρόμος'      : { u'αρσ' : [ u'-ος', u'-ου', u'-ο', u'-ε', u'-οι', u'-ων', u'-ους', u'-οι' ] },
  u'δρυς'        : { u'αρσ' : [ u'-υς', u'-υός', u'-υ', u'-υ', u'-ύες', u'-υών', u'-υς', u'-ύες' ] },
  u'δύναμη'      : { u'θηλ' : [ u'-η', [ u'-ης', u'->εως' ], u'-η', u'-η', u'->εις', u'->εων', u'->εις', u'->εις' ] },
  u'έδαφος'      : { u'ουδ' : [ u'-ος', u'->ους', u'-ος', u'-ος', u'->η', u'-ών', u'->η', u'->η' ] },
  u'ελπίδα'      : { u'θηλ' : [ u'-α', u'-ας', u'-α', u'-α', u'-ες', u'-ων', u'-ες', u'-ες' ] },
  u'εμβαδόν'     : { u'ουδ' : [ u'-όν', u'-ού', u'-όν', u'-όν', u'-ά', u'-ών', u'-ά', u'-ά' ] },
  u'εμπειρογνώμων' : { u'αρσ' : [ u'-ων', u'-ονος', u'-ονα', u'-ων', u'-ονες', u'-όνων', u'-ονες', u'-ονες' ] },
  u'έρημος'      : { u'θηλ' : [ u'-ος', u'->ου', u'-ο', u'-ο', u'-οι', u'->ων', u'->ους', u'-οι' ] },
  u'ερωμένη'     : { u'θηλ' : [ u'-η', u'-ης', u'-η', u'-η', u'-ες', u'-ων', u'-ες', u'-ες' ] },
  u'εφαπτομένη'  : { u'θηλ' : [ u'-η', u'-ης', u'-η', u'-η', u'-<ες', u'-ων', u'-<ες', u'-<ες' ] },
  u'ζάχαρη'      : { u'θηλ' : [ u'-η', u'-ης', u'-η', u'-η', u'-ες', None, u'-ες', u'-ες' ] },
  u'ηχώ'         : { u'θηλ' : [ u'-ώ', [ u'-ώς', u'-ούς' ], u'-ώ', u'-ώ' ]},
  u'θάλασσα'     : { u'θηλ' : [ u'-α', u'-ας', u'-α', u'-α', u'-ες', u'-ών', u'-ες', u'-ες' ] },
  u'θεράπων'     : { u'αρσ' : [ u'-ων', u'-οντος', u'-οντα', u'-ων', u'-οντες', u'-όντων', u'-οντες', u'-οντες' ] },
  u'ιππέας'      : { u'αρσ' : [ u'-έας', [ u'-έα', u'-έως' ], u'-έα', u'-έα', u'-είς', u'-έων', u'-είς', u'-είς' ] },
  u'ιστορία'     : { u'θηλ' : [ u'-α', u'-ας', u'-α', u'-α', u'-ες', u'-ών', u'-ες', u'-ες' ] },
  u'ισχύς'       : { u'θηλ' : [ u'-ύς', u'-ύος', u'-ύ', u'-ύ', u'-ύες', u'-ύων', u'-ύς', u'-ύες' ] },
  u'καρδιά'      : { u'θηλ' : [ u'-ά', u'-άς', u'-ά', u'-ά', u'-ές', u'-ών', u'-ές', u'-ές' ] },
  u'καρδινάλιος' : { u'αρσ' : [ u'-ος', u'->ου', u'-ο', u'-ε', u'-οι', u'->ων', u'-ους', u'-οι' ] },
  u'καφές'       : { u'αρσ' : [ u'-ές', u'-έ', u'-έ', u'-έ', u'-έδες', u'-έδων', u'-έδες', u'-έδες' ] },
  u'κόντες'      : { u'αρσ' : [ u'-ες', u'-ε', u'-ε', u'-ε', u'-ηδες', u'-ηδων', u'-ηδες', u'-ηδες' ] },
  u'κρέας'       : { u'ουδ' : [ u'-{οε=ας}', u'-ατος', u'-{αε=ας}', u'-{κε=ας}', u'-ατα', u'-άτων', u'-ατα', u'-ατα' ] },
  u'κύμα'        : { u'ουδ' : [ u'-α', u'-ατος', u'-α', u'-α', u'-ατα', u'-άτων', u'-ατα', u'-ατα' ] },
  u'λαχειοπώλης' : { u'αρσ' : [ u'-ης', u'-η', u'-η', u'-η', u'-ες', u'-ών', u'-ες', u'-ες' ] },
  u'λύση'        : { u'θηλ' : [ u'-η', [u'-ης', u'-εως'], u'-η', u'-η', u'-εις', u'-εων', u'-εις', u'-εις' ] },
  u'μανάβης'     : { u'αρσ' : [ u'-ης', u'-η', u'-η', u'-η', u'-ηδες', u'-ηδων', u'-ηδες', u'-ηδες' ] },
  u'μέλλον'      : { u'ουδ' : [ u'-ον', u'-οντος', u'-ον', u'-ον', u'-οντα', u'-όντων', u'-οντα', u'-οντα' ] },
  u'μίλι'        : { u'ουδ' : [ u'-ι', u'-ίου', u'-ι', u'-ι', u'-ια', u'-ίων', u'-ια', u'-ια' ] },
  u'μπαλωματής'  : { u'αρσ' : [ u'-ής', u'-ή', u'-ή', u'-ή', [ u'-ές', u'-ήδες' ], [ u'-ών', u'-ήδων' ], [ u'-ές', u'-ήδες' ], [ u'-ές', u'-ήδες' ] ] },
  u'ναύτης'      : { u'αρσ' : [ u'-ης', u'-η', u'-η', u'-η', u'-ες', u'-ών', u'-ες', u'-ες' ] },
  u'νίκη'        : { u'θηλ' : [ u'-η', u'-ης', u'-η', u'-η', u'-ες', u'-ών', u'-ες', u'-ες' ] },
  u'νικητής'     : { u'αρσ' : [ u'-ής', u'-ή', u'-ή', u'-ή', u'-ές', u'-ών', u'-ές', u'-ές' ] },
  u'νοικοκύρης'  : { u'αρσ' : [ u'-ης', u'-η', u'-η', u'-η', [ u'-ηδες', u'-αίοι' ], [ u'-ηδων', u'-αίων' ], [ u'-ηδες', u'-αίους' ], [ u'-ηδες', u'-αίοι' ] ] },
  u'νους'        : { u'αρσ' : [ u'-ους', u'-ου', u'-ου', u'-ου', u'-όες', None, u'-όες', u'-όες' ] },
  u'νότα'        : { u'θηλ' : [ u'-α', u'-ας', u'-α', u'-α', u'-ες', u'-ών', u'-ες', u'-ες' ] },
  u'οδός'        : { u'θηλ' : [ u'-ός', u'-ού', u'-ό', u'-ό', u'-οί', u'-ών', u'-ούς', u'-οί' ] },
  u'όνομα'       : { u'ουδ' : [ u'-α', u'->ατος', u'-α', u'-α', u'->ατα', u'-άτων', u'->ατα', u'->ατα' ] },
  u'ουρανός'     : { u'αρσ' : [ u'-ός', u'-ού', u'-ό', u'-έ', u'-οί', u'-ών', u'-ούς', u'-οί' ] },
  u'παιδάκι'     : { u'ουδ' : [ u'-κι', None  , u'-κι', u'-κι', u'-κια', None, u'-κια', u'-κια' ] },
  u'παιδί'       : { u'ουδ' : [ u'-ί', u'-ού', u'-ί', u'-ί', u'-ά', u'-ών', u'-ά', u'-ά' ] },
  u'παππούς'     : { u'αρσ' : [ u'-ούς', u'-ού', u'-ού', u'-ού', u'-ούδες', u'-ούδων', u'-ούδες', u'-ούδες' ] },
  u'παρόν'       : { u'ουδ' : [ u'-όν', u'-όντος', u'-όν', u'-όν', u'-όντα', u'-όντων', u'-όντα', u'-όντα' ] },
  u'πείνα'       : { u'θηλ' : [ u'-α', u'-ας', u'-α', u'-α', u'-ες', None, u'-ες', u'-ες' ] },
  u'περίπλους'   : { u'αρσ' : [ u'-ους', u'-ου', u'-ου', u'-ου', u'-οι', u'-ων', u'-ους', u'-οι' ] },
  u'πεύκο'       : { u'ουδ' : [ u'-ο', u'-ου', u'-ο', u'-ο', u'-α', u'-ων', u'-α', u'-α' ] },
  u'πραματευτής' : { u'αρσ' : [ u'-ής', u'-ή', u'-ή', u'-ή', [ u'-ές', u'-άδες' ], [ u'-ών', u'-άδων' ], [ u'-ές', u'-άδες' ], [ u'-ές', u'-άδες' ] ] },
  u'πρόβατο'     : { u'ουδ' : [ u'-α', [ u'-ου', u'->ου' ], u'-ο', u'-ο', u'-α', [ u'-ων', u'->ων' ], u'-α', u'-α' ] },
  u'πρόσωπο'     : { u'ουδ' : [ u'-ο', u'->ου', u'-ο', u'-ο', u'-α', u'->ων', u'-α', u'-α' ] },
  u'ρήγας'       : { u'αρσ' : [ u'-ας', u'-α', u'-α', u'-α', u'-άδες', u'-άδων', u'-άδες', u'-άδες' ] },
  u'σάλπιγγα'    : { u'θηλ' : [ u'-α', u'-ας', u'-α', u'-α', u'-ες', u'->ων', u'-ες', u'-ες' ] },
  u'σίδερο'      : { u'ουδ' : [ u'-ο', u'-ου', u'-ο', u'-ο', u'-α', u'-ων', u'-α', u'-α' ] },
  u'σκόνη'       : { u'θηλ' : [ u'-η', u'-ης', u'-η', u'-η', u'-ες', u'-ών', u'-ες', u'-ες' ] },
  u'στάχυ'       : { u'ουδ' : [ u'-υ', u'-υού', u'-υ', u'-υ', u'-υα', u'-υών', u'-υα', u'-υα' ] },
  u'σφουγγαράς'  : { u'αρσ' : [ u'-άς', u'-ά', u'-ά', u'-ά', u'-άδες', u'-άδων', u'-άδες', u'-άδες' ] },
  u'ταμίας'      : { u'αρσ' : [ u'-ας', u'-α', u'-α', u'-α', u'-ες', u'-ών', u'-ες', u'-ες' ] },
  u'τραγούδι'    : { u'ουδ' : [ u'-ι', u'-ιού', u'-ι', u'-ι', u'-ια', u'-ιών', u'-ια', u'-ια' ] },
  u'τσάι'        : { u'ουδ' : [ u'-ι', u'-γιού', u'-ι', u'-ι', u'-για', u'-γιών', u'-για', u'-για' ] },
  u'φύλακας'     : { u'αρσ' : [ u'-ας', u'-α', u'-α', u'-α', u'-ες', u'->ων', u'-ες', u'-ες' ] },
  u'φως'         : { u'ουδ' : [ u'-ως', u'-ωτός', u'-ως', u'-ως', u'-ώτα', u'-ώτων', u'-ώτα', u'-ώτα' ] },
  u'ψυχή'        : { u'θηλ' : [ u'-ή', u'-ής', u'-ή', u'-ή', u'-ές', u'-ών', u'-ές', u'-ές' ] },
  u'ώρα'         : { u'θηλ' : [ u'-α', u'-ας', u'-α', u'-α', u'-ες', u'-ών', u'-ες', u'-ες' ] },
}

adjective_patterns = {
  u'ο'   : {
    u'αρσ' : [ u'ο',  u'του', u'τον', None, u'οι', u'των', u'τους', None ],
    u'θηλ' : [ u'η',  u'της', u'την', None, u'οι', u'των', u'τις',  None ],
    u'ουδ' : [ u'το', u'του', u'το',  None, u'τα', u'των', u'τα',   None ]
  },
  u'άλλος'   : {
    u'αρσ' : [ u'-ος', u'-ου', u'-ον', u'-ε', u'-οι', u'-ων', u'-ους', u'-οι' ],
    u'θηλ' : [ u'-η', u'-ης', u'-ην', u'-η', u'-ες', u'-ων', u'-ες', u'-ες' ],
    u'ουδ' : [ u'-ο', u'-ου', u'-ο', u'-ο', u'-α', u'-ων', u'-α', u'-α' ]
  },
  u'αποχρών' : {
    u'αρσ' : [ u'-ών', u'-ώντος', u'-ώντα', u'-ών', u'-ώντες', u'-ώντων', u'-ώντες', u'-ώντες' ],
    u'θηλ' : [ u'-ώσα', u'-ώσας', u'-ώσα', u'-ώσα', u'-ώσες', u'-ωσών', u'-ώσες', u'-ώσες' ],
    u'ουδ' : [ u'-ών', u'-ώντος', u'-ών', u'-ών', u'-ώντα', u'-ώντων', u'-ώντα', u'-ώντα' ]
  },
  u'απών' : {
    u'αρσ' : [ u'-ών', u'-όντος', u'-όντα', u'-ών', u'-όντες', u'-όντων', u'-όντες', u'-όντες' ],
    u'θηλ' : [ u'-ούσα', [ u'-ούσας', u'-ούσης' ], u'-ούσα', u'-ούσα', u'-ούσες', u'-ουσών', u'-ούσες', u'-ούσες' ],
    u'ουδ' : [ u'-όν', u'-όντος', u'-όν', u'-όν', u'-ώντα', u'-ώντων', u'-ώντα', u'-ώντα' ]
  },
  u'βαθύς' : {
    u'αρσ' : [ u'-ύς', [ u'-ιού', u'-ύ' ], u'-ύ', u'-ύ', [ u'-ιοί', u'-είς' ], u'-ιών', [ u'-ούς', u'-είς' ], [ u'-οί', u'-είς' ] ],
    u'θηλ' : [ u'-ιά', u'-ιάς', u'-ιά', u'-ιά', u'-ιές', u'-ιών', u'-ιές', u'-ιές' ],
    u'ουδ' : [ u'-ύ', u'-ιού', u'-ύ', u'-ύ', u'-ιά', [ u'-ιών', u'-έων' ], u'-ιά', u'-ιά' ]
  },
  u'γλυκός' : {
    u'αρσ' : [ u'-ός', u'-ού', u'-ό', u'-έ', u'-οί', u'-ών', u'-ούς', u'-οί' ],
    u'θηλ' : [ u'-ιά', u'-ιάς', u'-ιά', u'-ιά', u'-ές', u'-ών', u'-ές', u'-ές' ],
    u'ουδ' : [ u'-ό', u'-ού', u'-ό', u'-ό', u'-ά', u'-ών', u'-ά', u'-ά' ]
  },
  u'δεξιός' : {
    u'αρσ' : [ u'-ός', u'-ού', u'-ό', u'-έ', u'-οί', u'-ών', u'-ούς', u'-οί' ],
    u'θηλ' : [ u'-ά', u'-άς', u'-ά', u'-ά', u'-ές', u'-ών', u'-ές', u'-ές' ],
    u'ουδ' : [ u'-ό', u'-ού', u'-ό', u'-ό', u'-ά', u'-ών', u'-ά', u'-ά' ]
  },
  u'δευτερεύων' : {
    u'αρσ' : [ u'-ων', u'-οντος', u'-οντα', u'-ων', u'-οντες', u'-όντων', u'-οντες', u'-οντες' ],
    u'θηλ' : [ u'-ουσα', [ u'-ουσας', u'-ουσης' ], u'-ουσα', u'-ουσα', u'-ουσες', u'-ουσών', u'-ουσες', u'-ουσες' ],
    u'ουδ' : [ u'-ον', u'-οντος', u'-ον', u'-ον', u'-οντα', u'-όντων', u'-οντα', u'-οντα' ]
  },
  u'ελώδης'  : {
    u'αρσ' : [ u'-ης', u'-ους', u'-η', u'-η', u'-εις', u'-ών', u'-εις', u'-εις' ],
    u'θηλ' : [ u'-ης', u'-ους', u'-η', u'-ης', u'-εις', u'-ών', u'-εις', u'-εις' ],
    u'ουδ' : [ u'-ες', u'-ους', u'-ες', u'-ες', u'-η', u'-ών', u'-η', u'-η' ]
  },
  u'εργαζόμενος' : {
    u'αρσ' : [ u'-ος', [ u'-ου', u'->ου' ], u'-ο', u'-ε', u'-οι', [ u'-ων', u'->ων' ], u'-ους', u'-οι' ],
    u'θηλ' : [ u'-η', [ u'-ης', u'->ης' ], [ u'-η', u'->η' ], [ u'-η', u'->η' ], u'-ες', [ u'-ων', u'->ων' ], u'-ες', u'-ες' ],
    u'ουδ' : [ u'-ο', [ u'-ου', u'->ου' ], u'-ο', u'-ο', u'-α', [ u'-ων', u'->ων' ], u'-α', u'-α' ]
  },
  u'ευθύς' : {
    u'αρσ' : [ u'-ύς', [ u'-ύ', u'-έος' ], u'-ύ', u'-ύ', u'-είς', u'-έων', u'-είς', u'-είς' ],
    u'θηλ' : [ u'-εία', u'-είας', u'-εία', u'-εία', u'-είες', u'-ειών', u'-είες', u'-είες' ],
    u'ουδ' : [ u'-ύ', [ u'-ύ', u'-έος' ], u'-ύ', u'-ύ', u'-έα', u'-έων', u'-έα', u'-έα' ]
  },
  u'ζηλιάρης'  : {
    u'αρσ' : [ u'-ης', u'-η', u'-η', u'-η', u'-ηδες', u'-ηδων', u'-ηδες', u'-ηδες' ],
    u'θηλ' : [ u'-α', u'-ας', u'-α', u'-α', u'-ες', u'-ων', u'-ες', u'-ες' ],
    u'ουδ' : [ u'-ικο', u'-ικου', u'-ικο', u'-ικο', u'-ικα', u'-ικων', u'-ικα', u'-ικα' ]
  },
  u'ζημιογόνος' : {
    u'αρσ' : [ u'-ος', u'-ου', u'-ο', u'-ε', u'-οι', u'-ων', u'-ους', u'-οι' ],
    u'θηλ' : [ u'-α',  u'-ας', u'-α', u'-α', u'-ες', u'-ων', u'-ες',  u'-ες' ],
    u'ουδ' : [ u'-ο',  u'-ου', u'-ο', u'-ο', u'-α',  u'-ων', u'-α',   u'-α' ]
  },
  u'θηλυκός' : {
    u'αρσ' : [ u'-ός', u'-ού', u'-ό', u'-έ', u'-οί', u'-ών', u'-ούς', u'-οί' ],
    u'θηλ' : [ u'-ή', u'-ής', u'-ή', u'-ή', u'-ές', u'-ών', u'-ές', u'-ές' ],
    u'ουδ' : [ u'-ό', u'-ού', u'-ό', u'-ό', u'-ά', u'-ών', u'-ά', u'-ά' ]
  },
  u'καλός'   : {
    u'αρσ' : [ u'-ός', u'-ού', u'-ό', u'-έ', u'-οί', u'-ών', u'-ούς', u'-οί' ],
    u'θηλ' : [ u'-ή', u'-ής', u'-ή', u'-ή', u'-ές', u'-ών', u'-ές', u'-ές' ],
    u'ουδ' : [ u'-ό', u'-ού', u'-ό', u'-ό', u'-ά', u'-ών', u'-ά', u'-ά' ]
  },
  u'κακοποιός' : {
    u'αρσ' : [ u'-ός', u'-ού', u'-ό', u'-έ', u'-οί', u'-ών', u'-ούς', u'-οί' ],
    u'θηλ' : [ u'-ός', u'-ού', u'-ό', u'-έ', u'-οί', u'-ών', u'-ούς', u'-οί' ],
    u'ουδ' : [ u'-ό',  u'-ού', u'-ό', u'-ό', u'-ά',  u'-ών', u'-ά',   u'-ά'  ]
  },
  u'μετριόφρων' : {
    u'αρσ' : [ [ u'-ων', u'-ονας' ], [ u'-ονος', u'-ονα' ], u'-ονα', u'-ων', u'-ονες', u'-όνων', u'-ονες', u'-ονες' ],
    u'θηλ' : [ u'-ων', u'-ονος', u'-ονα', u'-ων', u'-ονες', u'-όνων', u'-ονες', u'-ονες' ],
    u'ουδ' : [ u'-ον', u'-ονος', u'-ον', u'-ον', u'-ονα', u'-όνων', u'-ονα', u'-ονα' ]
  },
  u'όμορφος' : {
    u'αρσ' : [ u'-ος', u'-ου', u'-ο', u'-ε', u'-οι', u'-ων', u'-ους', u'-οι' ],
    u'θηλ' : [ u'-η', u'-ης', u'-η', u'-η', u'-ες', u'-ων', u'-ες', u'-ες' ],
    u'ουδ' : [ u'-ο', u'-ου', u'-ο', u'-ο', u'-α', u'-ων', u'-α', u'-α' ]
  },
  u'πλήρης'     : {
    u'αρσ' : [ u'-ης', u'-ους', u'-η',  u'-η(ς', u'-εις', u'-ων', u'-εις', u'-εις' ],
    u'θηλ' : [ u'-ης', u'-ους', u'-η',  u'-ης',  u'-εις', u'-ων', u'-εις', u'-εις' ],
    u'ουδ' : [ u'-ες', u'-ους', u'-ες', u'-ες',  u'-η',   u'-ων', u'-η',   u'-η'  ]
  },
  u'πλούσιος'   : {
    u'αρσ' : [ u'-ος', u'-ου', u'-ο', u'-ε', u'-οι', u'-ων', u'-ους', u'-οι' ],
    u'θηλ' : [ u'-α',  u'-ας', u'-α', u'-α', u'-ες', u'-ων', u'-ες',  u'-ες' ],
    u'ουδ' : [ u'-o',  u'-ου', u'-ο', u'-ο', u'-α',  u'-ων', u'-α',   u'-α'  ]
  },
  u'ποιoς'   : {
    u'αρσ' : [ u'-ος', [ u'-ου', u'-ανού' ], u'-ο(ν', None, u'-οι', [ u'-ων', u'-ανών' ], [ u'-ους', u'-ανούς' ] ],
    u'θηλ' : [ u'-α',  [ u'-ας', u'-ανής' ], u'-α',   None, u'-ες', [ u'-ων', u'-ανών' ], u'-ες' ],
    u'ουδ' : [ u'-o',  [ u'-ου', u'-ανού' ], u'-ο',   None, u'-α',  [ u'-ων', u'-ανών' ], u'-α' ]
  },
  u'πολύς' : {
    u'αρσ' : [ u'-ύς', u'-ύ', u'-ύ', None, u'-λοί', u'-λών', u'-λούς', u'-λοί' ],
    u'θηλ' : [ u'-λή', u'-λής', u'-λή', None, u'-λές', u'-λών', u'-λές', u'-λές' ],
    u'ουδ' : [ u'-ύ', u'-λού', u'-ύ', None, u'-λά', u'-λών', u'-λά', u'-λά' ]
  },
  u'πληγείς' : {
    u'αρσ' : [ u'-είς',  u'-έντος',              u'-έντα', u'-είς',  u'-έντες', u'-έντων', u'-έντες', u'-έντες' ],
    u'θηλ' : [ u'-είσα', [ u'-είσας', u'-είσης' ], u'-είσα', u'-είσα', u'-είσες', u'-εισών', u'-είσες', u'-είσες' ],
    u'ουδ' : [ u'-έν',   u'-έντος',              u'-έν',   u'-έν',   u'-εισών', u'-έντων', u'-έντα',  u'-έντα' ],
  },
  u'σταχτής' : {
    u'αρσ' : [ u'-ής', [ u'-ιού', u'-ή' ], u'-ή', u'-ή', u'-ιοί', u'-ιών', u'-ιούς', u'-ιοί' ],
    u'θηλ' : [ u'-ιά', u'-ιάς', u'-ιά', u'-ιά', u'-ιές', u'-ιών', u'-ιές', u'-ιές' ],
    u'ουδ' : [ u'-ί', u'-ιού', u'-ί', u'-ί', u'-ιά', u'-ιών', u'-ιά', u'-ιά' ],
  },
  u'συγγενής'  : {
    u'αρσ' : [ u'-ής', u'-ούς', u'-ή', u'-ή(ς', u'-είς', u'-ών', u'-είς', u'-είς' ],
    u'θηλ' : [ u'-ής', u'-ούς', u'-ή', u'-ής', u'-είς', u'-ών', u'-είς', u'-είς' ],
    u'ουδ' : [ u'-ές', u'-ούς', u'-ές', u'-ές', u'-ή', u'-ών', u'-ή', u'-ή' ]
  },
  u'συνεχής' : {
    u'αρσ' : [ u'-ής', u'-ούς', u'-ή', u'-ή', u'-είς', u'-ών', u'-είς', u'-είς' ],
    u'θηλ' : [ u'-ής', u'-ούς', u'-ή', u'-ής', u'-είς', u'-ών', u'-είς', u'-είς' ],
    u'ουδ' : [ u'-ές', u'-ούς', u'-ές', u'-ές', u'-ή', u'-ών', u'-ή', u'-ή' ]
  },
  u'συνήθης'  : {
    u'αρσ' : [ u'-ης', u'-ους', u'-η', u'-η(ς', u'-εις', u'-ων', u'-εις', u'-εις' ],
    u'θηλ' : [ u'-ης', u'-ους', u'-η', u'-ης', u'-εις', u'-ων', u'-εις', u'-εις' ],
    u'ουδ' : [ u'-ες', u'-ους', u'-ες', u'-ες', u'-η', u'-ων', u'-η', u'-η' ]
  },
  u'ωραίος'  : {
    u'αρσ' : [ u'-ος', u'-ου', u'-ο', u'-ε', u'-οι', u'-ων', u'-ους', u'-οι' ],
    u'θηλ' : [ u'-α', u'-ας', u'-α', u'-α', u'-ες', u'-ων', u'-ες', u'-ες' ],
    u'ουδ' : [ u'-ο', u'-ου', u'-ο', u'-ο', u'-α', u'-ων', u'-α', u'-α' ]
  }
}

verb_endings = {
  u'ω' : {
    u'ενεργητική' : {
      u'ενεστώτας'   : [ u'1-ω', u'1-εις', u'1-ει', u'1-ουμε', u'1-ετε', u'1-ουν' ],
      u'παρατατικός' : [ u'2-α', u'2-ες', u'2-ε', u'1α-αμε', u'1α-ατε', [ u'2-αν', u'1-ανε' ] ],
      u'μετοχή'      : [ u'1-οντας' ],
    },
  },
  u'άω-ώ' : {
    u'ενεργητική' : {
      u'ενεστώτας'   : [ [ u'1-ώ', u'1-άω' ], u'1-άς', [ u'1-ά', u'1-άει' ], [ u'1-άμε', u'1-ούμε' ], u'1-άτε', [ u'1-άνε', u'1-ούν(ε' ] ],
      u'παρατατικός' : [ u'1-ούσα', u'1-ούσες', u'1-ούσε', u'1-ούσαμε', u'1-ούσατε', u'1-ούσαν' ],
      u'μετοχή'      : [ u'1-ώντας' ],
      u'προστακτική' : [ u'2-α', u'1-άτε' ]
    },
  },
  u'άω-ώ2' : {
    u'ενεργητική' : {
      u'ενεστώτας'   : [ [ u'1-ώ', u'1-άω' ], [ u'1-άς', u'1-είς' ], [ u'1-ά', u'1-άει', u'1-εί' ], [ u'1-άμε', u'1-ούμε' ], [ u'1-άτε', u'1-είτε' ], [ u'1-άνε', u'1-ούν(ε' ] ],
      u'παρατατικός' : [ u'1-ούσα', u'1-ούσες', u'1-ούσε', u'1-ούσαμε', u'1-ούσατε', u'1-ούσαν' ],
      u'μετοχή'      : [ u'1-ώντας' ],
      u'προστακτική' : [ u'2-α', [ u'1-άτε', u'1-είτε' ] ]
    }
  },
  u'άω-γα' : {
    u'ενεργητική'    : {
      u'ενεστώτας'   : [ u'1-ώ', u'{θ1β}-ς', u'1-εί', u'1-με', u'1-τε', u'1-νε' ],
      u'παρατατικός' : [ u'2-γα', u'1-γες', u'1-γε', u'1-γαμε', u'1-γατε', [ u'2-γαν', u'1-γανε' ] ],
      u'μετοχή'      : [ u'1-γοντας' ],
    }
  },
}

def mpaino(args, pattern):
  if u'χαρ' not in args: args[u'χαρ'] = '3'
  if u'θαορ' not in args and u'θμελλ' in args: args[u'θαορ'] = args[u'θμελλ'] + u'ήκ'
  if u'ενεστ' in args:
    p = verb_endings[args[u'ενεστ']]
    for x in p:
      pattern.update(p[x])
    #del pattern[u'ενεστ']
    #print "found pattern enest"

def default_args(d):
  def setter(args, pattern):
    for x in d:
      if x not in args:
        args[x] = d[x]
  return setter

def spao(args, pattern):
  if u'θαορ' in args:
    args[u'1'] = args[u'θαορ']
    args[u'2'] = u'έ' + deaccent(args[u'θαορ'])
    pattern.update({
      u'αόριστος'  : [ u'2-α', u'2-ες', u'2-ε', u'1-αμε', u'1-ατε', [ u'2-αν', u'1-αν(ε' ] ],
      u'μέλλοντας' : [ u'1-ω', u'1-εις', u'1-ει', u'1-ουμε', u'1-ετε', u'1-ουν(ε' ],
      u'πρ3'    : [ u'1-ε' ],
      u'πρ4'    : [ u'1-τε' ],
      u'απαρέμφατο' : [ u'1-ει' ]
    })

def filter_flags(args, pattern):
  for p in pattern.keys():
    if p.endswith(u'=1'):
      key = p[:-2]
      if key in args:
        pattern[key] = pattern[p]
        if args[key] == u'1':
          del args[key]

def filter_participle(args, pattern):
  if u'χμτχ' not in args and u'μτχ' in pattern:
    del pattern[u'μτχ']
  #if u'μτχ1' in args:
    #pattern[u'μτχ1'] = pattern[u'μτχ1=1']

def filter_accent3(args, pattern):
  if '3' in args:
    if has_accent(args['3']):
      pattern[u'μέλλοντας'] = [ u'3-ω', u'3-εις', u'3-ει', u'3-ουμε', u'3-ετε', u'3-ουν(ε' ]
      pattern[u'απαρέμφατο'] = [ u'3-ει' ]
    else:
      pattern[u'μέλλοντας'] = [ u'3-ώ', u'3-είς', u'3-εί', u'3-ούμε', u'3-είτε', u'3-ούν(ε' ]
      pattern[u'απαρέμφατο'] = [ u'3-εί' ]

verb_patterns = {
  u'αγαπιέμαι' : {
    u'παθητική' : {
      u'ενεστώτας'   : [ u'-ιέμαι', u'-ιέσαι', u'-ιέται', u'-ιόμαστε', u'-ιέστε', u'-ιούνται' ],
      u'παρατατικός' : [
        u'-ιόμουν(α',
        u'-ιόσουν(α',
        u'-ιόταν(ε',
        [ u'-ιόμασταν', u'-ιόμαστε' ],
        [ u'-ιόσασταν', u'-ιόσαστε' ],
        [ u'-ιόνταν', u'-ιούνταν', u'-ιόντουσαν' ]
      ],
      u'αόριστος'    : [
        u'-{φαορ=η}>{χαορ=θ}ηκα',
        u'-{φαορ=η}>{χαορ=θ}ηκες',
        u'-{φαορ=η}>{χαορ=θ}ηκε',
        u'-{φαορ=η}{χαορ=θ}ήκαμε',
        u'-{φαορ=η}{χαορ=θ}ήκατε',
        [ u'-{φαορ=η}>{χαορ=θ}ηκαν', u'-{φαορ=η}{χαορ=θ}ήκανε' ]
      ],
      u'μέλλοντας'   : [
        u'-{φαορ=η}{χαορ=θ}ώ',
        u'-{φαορ=η}{χαορ=θ}είς',
        u'-{φαορ=η}{χαορ=θ}εί',
        u'-{φαορ=η}{χαορ=θ}ούμε',
        u'-{φαορ=η}{χαορ=θ}είτε',
        u'-{φαορ=η}{χαορ=θ}ούν(ε'
      ],
      u'πρ1'         : [ u'-{φαορ=η}<{σ=σ}ου' ],
      u'πρ2'         : [ u'-{φαορ=η}{χαορ=θ}είτε' ],
      u'απαρέμφατο'  : [ u'-{φαορ=η}{χαορ=θ}εί' ],
      u'μτχ'         : [ u'-{φαορ=η}μένος' ],
    }
  },
  u'αγαπώ' : {
    u'ενεργητική' : {
      u'ενεστώτας'   : [ [ u'-ώ', u'-άω' ], u'-άς', [ u'-ά', u'-άει' ], [ u'-άμε', u'-ούμε' ], u'-άτε', [ u'-άνε', u'-ούν(ε' ] ],
      u'παρατατικός' : [ u'-ούσα', u'-ούσες', u'-ούσε', u'-ούσαμε', u'-ούσατε', u'-ούσαν' ],
      u'πρ1'         : [ u'-<α' ],
      u'πρ2'         : [ u'-άτε' ],
      u'πρ3'         : [ u'-<{θαορ!}η{σ=σ}ε' ],
      u'πρ4'         : [ u'-ή{σ=σ}τε' ],
      u'μετοχή'      : [ u'-ώντας' ],
      u'αόριστος'    : [ u'-<{θαορ!}η{σ=σ}α', u'-<{θαορ!}η{σ=σ}ες', u'-<{θαορ!}η{σ=σ}ε', u'-ή{σ=σ}αμε', u'-ή{σ=σ}ατε', [ u'-<{θαορ!}η{σ=σ}αν', u'-ή{σ=σ}ανε' ] ],
      u'μέλλοντας'      : [ u'-ή{σ=σ}ω', u'-ή{σ=σ}εις', u'-ή{σ=σ}ει', u'-ή{σ=σ}ουμε', u'-ή{σ=σ}ετε', u'-ή{σ=σ}ουν(ε' ],
      u'απαρέμφατο'      : [ u'-ή{σ=σ}ει' ],
    }
  },
  u'αιτώ' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ώ', u'-είς', u'-εί', u'-ούμε', u'-είτε', u'-ούν' ],
      u'παρατατικός' : [ u'-ούσα', u'-ούσες', u'-ούσε', u'-ούσαμε', u'-ούσατε', u'-ούσαν' ],
      u'αόριστος' : [ u'-<ησα', u'-<ησες', u'-<ησε', u'-ήσαμε', u'-ήσατε', [ u'-<ησαν', u'-ήσανε' ] ],
      u'πρ1' : [ u'-<ησε' ],
      u'πρ2' : [ u'-είτε' ],
      u'μετοχή' : [ u'-ώντας' ],
      u'απαρέμφατο' : [ u'-ήσει' ],
    }
  },
  u'αγωνιώ' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ώ', u'-άς', u'-ά', u'-ούμε', u'-άτε', u'-ούν(ε' ],
      u'παρατατικός' : [ u'-ούσα', u'-ούσες', u'-ούσε', u'-ούσαμε', u'-ούσατε', u'-ούσαν' ],
      u'πρ2' : [ u'-άτε' ],
      u'μετοχή' : [ u'-ώντας' ],
    }
  },
  u'αδυνατώ' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ώ', u'-είς', u'-εί', u'-ούμε', u'-είτε', u'-ούν' ],
      u'παρατατικός' : [ u'-ούσα', u'-ούσες', u'-ούσε', u'-ούσαμε', u'-ούσατε', u'-ούσαν' ],
      u'πρ1' : [ u'-<ει' ],
      u'πρ2' : [ u'-είτε' ],
      u'μετοχή' : [ u'-ώντας' ],
    }
  },
  u'ακούω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ω', u'-ς', u'-ει', u'-με', u'-τε', u'-νε' ],
      u'παρατατικός' : [ u'-<γα', u'-<γες', u'-<γε', u'-γαμε', u'-γατε', [ u'-<γαν', u'-γανε' ] ],
      u'πρ1' : [ u'-<' ],
      u'πρ2' : [ u'-<γε' ],
      u'πρ3' : [ u'-ετε' ],
      u'πρ4' : [ u'-στε' ],
      u'μετοχή' : [ u'-γοντας' ],
      u'αόριστος' : [ u'-<σα', u'-<σες', u'-<σε', u'-σαμε', u'-σατε', [ u'-<σαν', u'-σανε' ] ],
      u'μέλλοντας' : [ u'-σω', u'-σεις', u'-σει', u'-σουμε', u'-σετε', u'-σουνε' ],
      u'απαρέμφατο' : [ u'-σ?ει' ],
    }
  },
  u'αλλάζω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ω', u'-εις', u'-ει', u'-ουμε', u'-ετε', u'-ουν' ],
      u'παρατατικός' : [ u'-<α', u'-<ες', u'-<ε', u'-αμε', u'-ατε', [ u'-<αν', u'-ανε' ] ],
      u'πρ1' : [ u'-<ε' ],
      u'πρ2' : [ u'-ετε' ],
      u'πρ3' : [ u'-/ξε' ],
      u'πρ4' : [ u'-/ξετε' ],
      u'μετοχή' : [ u'-οντας' ],
      u'αόριστος' : [ u'-</{σ=ξ}α', u'-</{σ=ξ}ες', u'-</{σ=ξ}ε', u'-/{σ=ξ}αμε', u'-/{σ=ξ}ατε', [ u'-</{σ=ξ}αν', u'-/{σ=ξ}ανε' ] ],
      u'μέλλοντας' : [ u'-/{σ=ξ}ω', u'-/{σ=ξ}εις', u'-/{σ=ξ}ει', u'-/{σ=ξ}ουμε', u'-/{σ=ξ}ετε', u'-/{σ=ξ}ουν(ε' ],
      u'απαρέμφατο' : [ u'-/{σ=ξ}ει' ],
      #u'μτχ' : [ u'-/{χμτχ=γμ}ένος' ],
    }
  },
  u'αμύνομαι' : {
    u'process_args' : [ filter_participle, filter_flags ],
    u'παθητική' : {
      u'ενεστώτας' : [ u'-ομαι', u'-εσαι', u'-εται', u'-όμαστε', u'-εστε', u'-ονται' ],
      u'παρατατικός' : [ u'-όμουν(α', u'-όσουν(α', u'-όταν(ε', u'-όμασταν', u'-όσασταν', [ u'-ονταν', u'-όντουσαν' ] ],
      u'αόριστος' : [ u'-/{χαορ=νθ}ηκα', u'-/{χαορ=νθ}ηκες', u'-/{χαορ=νθ}ηκε', u'-/{χαορ=νθ}ήκαμε', u'-/{χαορ=νθ}ήκατε', [ u'-/{χαορ=νθ}ηκαν', u'-/{χαορ=νθ}ήκαν(ε' ]],
      u'μέλλοντας' : [ u'-/{χαορ=νθ}ώ', u'-/{χαορ=νθ}είς', u'-/{χαορ=νθ}εί', u'-/{χαορ=νθ}ούμε', u'-/{χαορ=νθ}είτε', u'-/{χαορ=νθ}ούν(ε' ],
      u'πρ1' : [ u'-ου' ],
      u'πρ2' : [ u'-εστε' ],
      u'πρ3' : [ u'-/{σ=νσ}ου' ],
      u'πρ4' : [ u'-/{χαορ=νθ}είτε' ],
      u'απαρέμφατο' : [ u'-/{χαορ=νθ}εί' ],
      u'μτχ1=1' : [ u'-όμενος' ],
      u'μτχ' : [ u'-/{χμτχ=-}ένος' ],
    }
  },
  u'ανάβω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ω', u'-εις', u'-ει', u'-ουμε', u'-ετε', u'-ουν' ],
      u'παρατατικός' : [ u'-<α', u'-<ες', u'-<ε', u'-αμε', u'-ατε', [ u'-<αν', u'-ανε' ] ],
      u'πρ1' : [ u'-<ε' ],
      u'πρ2' : [ u'-ετε' ],
      u'πρ3' : [ u'-</ψε' ],
      u'πρ4' : [ u'-/ψετε' ],
      u'μετοχή' : [ u'-οντας' ],
      u'αόριστος' : [ u'-</ψα', u'-</ψες', u'-</ψε', u'-/ψαμε', u'-/ψατε', [ u'-</ψαν', u'-/ψανε' ] ],
      u'μέλλοντας' : [ u'-/ψω', u'-/ψεις', u'-/ψει', u'-/ψουμε', u'-/ψετε', u'-/ψουν(ε' ],
      u'απαρέμφατο' : [ u'-/ψει' ],
      #u'μτχ' : [ u'-/μμένος' ],
    }
  },
  u'ανακτώ' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ώ', u'-άς', u'-ά', u'-ούμε', u'-άτε', u'-ούν(ε' ],
      u'παρατατικός' : [ u'-ούσα', u'-ούσες', u'-ούσε', u'-ούσαμε', u'-ούσατε', u'-ούσαν(ε' ],
      u'πρ1' : [ u'-<α' ],
      u'πρ2' : [ u'-άτε' ],
      u'πρ3' : [ u'-<σε' ],
      u'πρ4' : [ u'-ήστε' ],
      u'μετοχή' : [ u'-ώντας' ],
      u'αόριστος' : [ u'-<ησα', u'-<ησες', u'-<ησε', u'-ήσαμε', u'-ήσατε', [ u'-<ησαν', u'-ήσανε' ]],
      u'απαρέμφατο' : [ u'-ήσει' ],
    }
  },
  u'αναμένομαι' : {
    u'process_args' : [ filter_participle ],
    u'παθητική' : {
      u'ενεστώτας' : [ u'-ομαι', u'-εσαι', u'-εται', u'-όμαστε', u'-εστε', u'-ονται' ],
      u'παρατατικός' : [ u'-όμουν(α', u'-όσουν(α', u'-όταν(ε', [ u'-όμασταν', u'-όμαστε' ], [ u'-όσασταν', u'-όσαστε' ], [ u'-ονταν', u'-όντουσαν' ] ],
      u'πρ1' : [ u'-ένου' ],
      u'πρ2' : [ u'-ένεστε' ],
      u'μτχ1=1' : [ u'-όμενος' ],
    }
  },
  u'ανεβαίνω' : {
    u'process_args' : [ filter_accent3 ],
    u'ενεργητική' : {
      u'ενεστώτας'    : [ u'1-ω', u'1-εις', u'1-ει', u'1-ουμε', u'1-ετε', u'1-ουν' ],
      u'παρατατικός'  : [ u'2-α', u'2-ες', u'2-ε', u'1-αμε', u'1-ατε', [ u'2-αν', u'1-ανε' ] ],
      u'πρ1'          : [ u'2-ε' ],
      u'πρ2'          : [ u'1-ετε' ],
      u'πρ3'          : [ u'4-α' ],
      u'πρ4'          : [ u'3-{pr4=εί}τε' ],
      u'μετοχή'       : [ u'1-οντας' ],
      u'αόριστος'     : [ u'4-ηκα', u'4-ηκες', u'4-ηκε', u'3-ήκαμε', u'3-ήκατε', [ u'4-αν', u'3-ήκανε' ] ],
      u'μέλλοντας'    : [ u'3-ω', u'3-εις', u'3-ει', u'3-ουμε', u'3-ετε', u'3-ουν(ε' ],
      u'απαρέμφατο'   : [ u'3-ει' ],
    }
  },
  u'βαριέμαι' : {
    u'ενεργητική' : {
      u'ενεστώτας'   : [ u'-ιέμαι', u'-ιέσαι', u'-ιέται', u'-ιόμαστε', u'-ιέστε', u'-ιούνται' ],
      u'παρατατικός' : [ u'-ιόμουν(α', u'-ιόσουν(α', u'-ιόταν(ε', [ u'-ιόμασταν', u'-ιόμαστε' ], [ u'-ιόσασταν', u'-ιόσαστε' ], [ u'-ιόνταν', u'-ούνταν', u'-ιόντουσαν' ] ],
      u'αόριστος'    : [ u'-έθηκα', u'-έθηκες', u'-έθηκε', u'-εθήκαμε', u'-εθήκατε', [ u'-έθηκαν', u'-εθήκαν(ε' ]],
      u'μέλλοντας'   : [ u'-εθώ', u'-εθτείς', u'-εθτεί', u'-εθούμε', u'-εθείτε', u'-εθούν(ε' ],
      u'πρ2'         : [ u'-εθείτε' ],
      u'απαρέμφατο'  : [ u'-εθεί' ],
      u'μτχ'         : [ u'-εμένος' ],
    }
  },
  u'βλέπω' : {
    u'ενεργητική' : {
      u'ενεστώτας'   : [ u'1-ω', u'1-εις', u'1-ει', u'1-ουμε', u'1-ετε', u'1-ουν' ],
      u'παρατατικός' : [ u'έ+2-α', u'έ+2-ες', u'έ+2-ε', u'1-αμε', u'1-ατε', [ u'έ+2-αν', u'1-ανε' ] ],
      u'πρ1'         : [ u'1-ε' ],
      u'πρ2'         : [ u'1-ετε' ],
      u'πρ3'         : [ u'4-ές' ],
      u'πρ4'         : [ u'4-είτε' ],
      u'μετοχή'      : [ u'1-οντας' ],
      u'αόριστος'    : [ u'3-α', u'3-ες', u'3-ε', u'3-αμε', u'3-ατε', u'3-αν(ε' ],
      u'μέλλοντας'   : [ u'4-ω', u'4-είς', u'4-εί', u'4-ούμε', u'4-είτε', u'4-ούν(ε' ],
      u'απαρέμφατο'  : [ u'4-ει' ],
      u'μτχ'         : [ u'5' ],
    }
  },
  u'βαρώ' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ [ u'-άω', u'-ώ' ], u'-άς', [ u'-άει', u'-ά' ], [ u'-άμε', u'-ούμε' ], u'-άτε', [ u'-άνε', u'-ούν' ] ],
      u'παρατατικός' : [ u'-ούσα', u'-ούσες', u'-ούσε', u'-ούσαμε', u'-ούσατε', u'-ούσαν' ],
      u'πρ1' : [ u'-<α' ],
      u'πρ2' : [ u'-άτε' ],
      u'πρ3' : [ u'-<σε' ],
      u'πρ4' : [ u'-έστε' ],
      u'μετοχή' : [ u'-ώντας' ],
      u'αόριστος' : [ u'-<εσα', u'-<εσες', u'-<εσε', u'-έσαμε', u'-έσατε', [ u'-<εσαν', u'-έσανε' ]],
      u'απαρέμφατο' : [ u'-έσει' ],
    },
    u'παθητική' : {
      u'μτχ' : [ u'-εμένος' ],
    }
  },
  u'γελιέμαι' : {
    u'παθητική' : {
      u'ενεστώτας' : [ [ u'-ιέμαι', u'-ώμαι' ], [ u'-ιέσαι', u'-άσαι' ], [ u'-ιέται', u'-άται' ], [ u'-ιόμαστε', u'-ώμεθα' ], [ u'-ιέστε', u'-άσθε' ], [ u'-ιώνται', u'-ώνται' ] ],
      u'παρατατικός' : [ [ u'-ιόμουν(α', u'ε+-ώμην' ], [ u'-ιόσουν(α', u'ε+-άσο' ], [ u'-ιόταν(ε', u'ε+-άτο' ], [ u'-ιόμασταν', u'-ιόμαστε', u'ε+-ώμεθα' ], [ u'-ιόσασταν', u'-ιόσαστε', u'ε+-άσθε' ], [ u'-όνταν', u'-ούνταν', u'-ιόντανε', u'-ιόντουσαν', u'ε+-ώντο' ] ],
      u'αόριστος' : [ u'-άστ{θαορ!}ηκα', u'-άστ{θαορ!}ηκες', u'-άστ{θαορ!}ηκε', u'-αστ{θαορ!}ήκαμε', u'-αστ{θαορ!}ήκατε', [ u'-άστ{θαορ!}ηκαν', u'-αστ{θαορ!}ήκαν(ε' ]],
      u'μέλλοντας' : [ u'-αστ{θαορ!}ώ', u'-αστ{θαορ!}είς', u'-αστ{θαορ!}εί', u'-αστ{θαορ!}ούμε', u'-αστ{θαορ!}είτε', u'-αστ{θαορ!}ούν(ε' ],
      u'πρ2' : [ u'-αστ{θαορ!}είτε' ],
      u'απαρέμφατο' : [ u'-αστ{θαορ!}εί' ],
      u'μτχ' : [ u'-αστ{θαορ!}/μένος' ],
    }
  },
  u'γελώ' : {
    u'process_args' : [ filter_flags ],
    u'ενεργητική' : {
      u'ενεστώτας' : [ [ u'-ώ', u'-άω' ], u'-άς', [ u'-ά', u'-άει' ], [ u'-άμε', u'-ούμε' ], u'-άτε', [ u'-άνε', u'-ούνε' ]],
      u'παρατατικός' : [ u'-ούσα', u'-ούσες', u'-ούσε', u'-ούσαμε', u'-ούσατε', u'-ούσαν' ],
      u'πρ1' : [ u'-<α' ],
      u'πρ2' : [ u'-άτε' ],
      u'πρ3' : [ u'-<{σ=σ}ε' ],
      u'πρ4' : [ u'-ά{σ=σ}τε' ],
      u'μετοχή' : [ u'-ώντας' ],
      u'αόριστος' : [ u'-<α{σ=σ}{θαορ!}α', u'-<α{σ=σ}{θαορ!}ες', u'-<α{σ=σ}{θαορ!}ε', u'-ά{σ=σ}{θαορ!}>αμε', u'-ά{σ=σ}{θαορ!}>ατε', [ u'-<α{σ=σ}{θαορ!}αν', u'-ά{σ=σ}{θαορ!}>ανε' ]],
      u'μέλλοντας' : [ u'-ά{σ=σ}{θαορ!}>ω', u'-ά{σ=σ}{θαορ!}>εις', u'-ά{σ=σ}{θαορ!}>ει', u'-ά{σ=σ}{θαορ!}>ουμε', u'-ά{σ=σ}{θαορ!}>ετε', u'-ά{σ=σ}{θαορ!}>ουν(ε' ],
      u'απαρέμφατο' : [ u'-ά{σ=σ}{θαορ!}>ει' ],
    },
    u'παθητική' : {
      u'παρακΒ=1' : [ u'-ασ{θαορ!}μένος' ],
    }
  },
  u'δένομαι'  : {
    u'process_args' : [ filter_flags ],
    u'παθητική' : {
      u'ενεστώτας'    : [ u'1-ομαι', u'1-ένεσαι', u'1-ένεται', u'1-ενόμαστε', u'1-ένεστε', u'1-ένονται' ],
      u'παρατατικός'  : [ u'2-όμουν(α', u'2-όσουν(α', u'2-όταν(ε', u'2-όμασταν', u'2-όσασταν', [ u'1-ονταν', u'2-όντουσαν' ] ],
      u'αόριστος'     : [ u'3-ηκα', u'3-ηκες', u'3-ηκε', u'4-ήκαμε', u'4-ήκατε', [ u'3-ηκαν', u'4-ήκαν(ε' ]],
      u'μέλλοντας'    : [ u'4-ώ', u'4-είς', u'4-εί', u'4-ούμε', u'4-είτε', u'4-ούν(ε' ],
      u'πρ1'          : [ u'1-ου'],
      u'πρ2'          : [ u'1-εστε' ],
      u'πρ3'          : [ u'6-ου' ],
      u'πρ4'          : [ u'4-είτε' ],
      u'απαρέμφατο'   : [ u'4-εί' ],
      u'μτχ'          : [ u'5-ένος' ],
      u'μτχ1=1'       : [ u'2-όμενος' ],
    }
  },
  u'δένω' : {
    u'ενεργητική' : {
      u'ενεστώτας'   : [ u'{6}1-ω', u'{6}1-εις', u'{6}1-ει', u'{6}1-ουμε', u'{6}1-ετε', u'{6}1-ουν' ],
      u'παρατατικός' : [ u'{7}έ+2-α', u'{7}έ+2-ες', u'{7}έ+2-ε', u'{6}1-αμε', u'{6}1-ατε', [ u'{7}έ+2-αν', u'{6}1-ανε' ] ],
      u'πρ1'         : [ u'{8}2-ε' ],
      u'πρ2'         : [ u'{6}1-ετε' ],
      u'πρ3'         : [ u'{8}4-ε' ],
      u'πρ4'         : [ u'{6}3-τε' ],
      u'μετοχή'      : [ u'{6}1-οντας' ],
      u'αόριστος'    : [ u'{7}έ+4-α', u'{7}έ+4-ες', u'{7}έ+4-ε', u'{6}3-αμε', u'{6}3-ατε', [ u'{7}έ+4-αν', u'{6}3-ανε' ] ],
      u'μέλλοντας'   : [ u'{6}3-ω', u'{6}3-εις', u'{6}3-ει', u'{6}3-ουμε', u'{6}3-ετε', u'{6}3-ουν(ε' ],
      u'απαρέμφατο'  : [ u'{6}3-ει' ],
    },
    u'παθητική' : {
      u'μτχ'         : [ u'{6}5-ένος' ],
    }
  },
  u'δηλώνομαι' : {
    u'παθητική' : {
      u'ενεστώτας'   : [ u'-ομαι', u'-εσαι', u'-εται', u'-όμαστε', u'-εστε', u'-ονται' ],
      u'παρατατικός' : [ u'-όμουν(α', u'-όσουν(α', u'-όταν(ε', u'-όμασταν', u'-όσασταν', [ u'-ονταν', u'-όντουσαν' ] ],
      u'αόριστος'    : [ u'-/{χαορ=θ}ηκα', u'-/{χαορ=θ}ηκες', u'-/{χαορ=θ}ηκε', u'-/{χαορ=θ}ήκαμε', u'-/{χαορ=θ}ήκατε', [ u'-/{χαορ=θ}ηκαν', u'-/{χαορ=θ}ήκαν(ε' ]],
      u'μέλλοντας'   : [ u'-/{χαορ=θ}ώ', u'-/{χαορ=θ}είς', u'-/{χαορ=θ}εί', u'-/{χαορ=θ}ούμε', u'-/{χαορ=θ}είτε', u'-/{χαορ=θ}ούν(ε' ],
      u'πρ1'         : [ u'-/{σ=σ}ου' ],
      u'πρ2'         : [ u'-/{χαορ=θ}είτε' ],
      u'απαρέμφατο'  : [ u'-/{χαορ=θ}εί' ],
      u'μτχ'         : [ u'-/{χμτχ=μ}ένος' ],
      u'μτχ1=1'      : [ u'-όμενος' ],
    }
  },
  u'δηλώνω' : {
    u'ενεργητική' : {
      u'ενεστώτας'   : [ u'-νω', u'-νεις', u'-νει', u'-νουμε', u'-νετε', u'-νουν' ],
      u'παρατατικός' : [ u'-<να', u'-<νες', u'-<νε', u'-ναμε', u'-νατε', [ u'-<ναν', u'-νανε' ] ],
      u'πρ1'         : [ u'-<νε' ],
      u'πρ2'         : [ u'-νετε' ],
      u'πρ3'         : [ u'-<σε' ],
      u'πρ4'         : [ u'-στε' ],
      u'μετοχή'      : [ u'-νοντας' ],
      u'αόριστος'    : [ u'-<σα', u'-<σες', u'-<σε', u'-σαμε', u'-σατε', [ u'-<σαν', u'-σανε' ] ],
      u'μέλλοντας'   : [ u'-σω', u'-σεις', u'-σει', u'-σουμε', u'-σετε', u'-σουν(ε' ],
      u'απαρέμφατο'  : [ u'-σει' ],
    },
    u'παθητική' : {
      u'μτχ'         : [ u'-μένος' ],
    }
  },
  u'δικαιούμαι' : {
    u'παθητική' : {
      u'ενεστώτας' : [ u'-ούμαι', u'-ούσαι', u'-ούται', [ u'-ούμαστε', u'-ούμεθα' ], [ u'-ούσθε', u'-ούστε' ], u'-ούνται' ],
      u'παρατατικός' : [ [ u'-ούμουν', u'-ούμην' ], [ u'-ούσουν', u'-ούσο' ], [ u'-ούνταν', u'-ούτο' ], [ u'-ούμασταν', u'-ούμαστε' ], [ u'-ούσασταν', u'-ούσαστε' ], [ u'-ούνταν', u'-ούντο' ] ],
      u'μτχ' : [ u'-ούμενος' ],
    }
  },
  u'δροσίζω'  : {
    u'ενεργητική' : {
      u'ενεστώτας'  : [ u'1-ω', u'1-εις', u'1-ει', u'1-ουμε', u'1-ετε', u'1-ουν' ],
      u'παρατατικός'  : [ u'2-α', u'2-ες', u'2-ε', u'1{θ1α!}-αμε', u'1{θ1α!}-ατε', [ u'2-αν', u'1{θ1α!}-ανε' ] ],
      u'πρ1'    : [ u'2-ε' ],
      u'πρ2'    : [ u'1-ετε' ],
      u'πρ3'    : [ u'4-ε' ],
      u'πρ4'    : [ u'3-{pr4=}τε' ],
      u'μετοχή' : [ u'1-οντας' ],
      u'αόριστος'    : [ u'4-α', u'4-ες', u'4-ε', u'3{θ4α!}-αμε', u'3{θ4α!}-ατε', [ u'4-αν', u'3{θ4α!}-ανε' ] ],
      u'μέλλοντας' : [ u'3-ω', u'3-εις', u'3-ει', u'3-ουμε', u'3-ετε', u'3-ουν(ε' ],
      u'απαρέμφατο' : [ u'3-ει' ],
    },
    u'παθητική' : {
      u'μτχ' : [ u'5-ένος' ]
    }
  },
  u'εγγυώμαι' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ώμαι', u'-άσαι', u'-άται', [ u'-όμαστε', u'-ώμεθα' ], [ u'-άστε', u'-άσθε' ], [ u'-ούνται', u'-ώνται' ] ],
      u'παρατατικός' : [ u'-όμουν(α', u'-όσουν(α', [ u'-όταν(ε', u'-άτο' ], [ u'-όμασταν', u'-όμαστε', u'-ώμεθα' ], [ u'-όσασταν', u'-όσαστε', u'-άσθε' ], [ u'-όνταν(ε', u'-ούνταν', u'-όντουσαν', u'-ώντο' ] ],
      u'αόριστος' : [ u'-ήθηκα', u'-ήθηκες', u'-ήθηκε', u'-ηθήκαμε', u'-ηθήκατε', [ u'-ήθηκαν', u'-ηθήκαν(ε' ]],
      u'μέλλοντας' : [ u'-ηθώ', u'-ηθείς', u'-ηθεί', u'-ηθούμε', u'-ηθείτε', u'-ηθούν(ε' ],
      u'πρ3' : [ u'-ήσου' ],
      u'πρ4' : [ u'-ηθείτε' ],
      u'απαρέμφατο' : [ u'-ηθεί' ],
    },
    u'παθητική' : {
      u'μτχ' : [ u'-ώμενος', u'-ηθείς', u'-ημένος' ],
    }
  },
  u'ενώνομαι' : {
    u'παθητική' : {
      u'ενεστώτας' : [ u'-ομαι', u'-εσαι', u'-εται', u'-όμαστε', u'-εστε', u'-ονται' ],
      u'παρατατικός' : [ u'-όμουν(α', u'-όσουν(α', u'-όταν(ε', u'-όμασταν', u'-όσασταν', [ u'-ονταν', u'-όντουσαν' ] ],
      u'αόριστος' : [ u'-/θηκα', u'-/θηκες', u'-/θηκε', u'-/θήκαμε', u'-/θήκατε', [ u'-/θηκαν', u'-/θήκαν(ε' ]],
      u'μέλλοντας' : [ u'-/θώ', u'-/θείς', u'-/θεί', u'-/θούμε', u'-/θείτε', u'-/θούν(ε' ],
      u'πρ3' : [ u'-/σου' ],
      u'πρ4' : [ u'-/θείτε' ],
      u'απαρέμφατο' : [ u'-/θεί' ],
      u'μτχ' : [ u'-/μένος' ],
    }
  },
  u'ενώνω' : {
    u'ενεργητική' : {
      u'ενεστώτας'   : [ u'1-νω', u'1-νεις', u'1-νει', u'1-νουμε', u'1-νετε', u'1-νουν' ],
      u'παρατατικός'   : [ u'2-να', u'2-νες', u'2-νε', u'1-ναμε', u'1-νατε', [ u'2-ναν', u'1-νανε' ] ],
      u'μετοχή'  : [ u'1-νοντας' ],
      u'αόριστος'     : [ u'2-σα', u'2-σες', u'2-σε', u'1-σαμε', u'1-σατε', [ u'2-σαν', u'1-σανε' ] ],
      u'μέλλοντας'  : [ u'1-σω', u'1-σεις', u'1-σει', u'1-σουμε', u'1-σετε', u'1-σουν(ε' ],
      u'απαρέμφατο'  : [ u'1-σει' ],
      u'μτχ'     : [ u'3-μένος' ],
      u'πρ1'     : [ u'2-νε' ],
      u'πρ2'     : [ u'1-νετε' ],
      u'πρ3'     : [ u'2-σε' ],
      u'πρ4'     : [ u'1-στε' ],
    }
  },
  u'ζητώ' : {
    u'ενεργητική' : {
      u'ενεστώτας'   : [ [ u'1-ώ', u'1-άω' ], [ u'1-άς', u'1-είς' ], [ u'1-ά', u'1-άει', u'1-εί' ], [ u'1-άμε', u'1-ούμε' ], [ u'1-άτε', u'1-είτε' ], [ u'1-άνε', u'1-ούν(ε' ] ],
      u'παρατατικός' : [ u'-ούσα', u'-ούσες', u'-ούσε', u'-ούσαμε', u'-ούσατε', u'-ούσαν' ],
      u'πρ1'   : [ u'-<α' ],
      u'πρ2'   : [ u'-άτε' ],
      u'πρ3'   : [ u'-<{φαορ=η}σε' ],
      u'πρ4'   : [ u'-{φαορ=η}>στε' ],
      u'μετοχή' : [ u'-ώντας' ],
      u'αόριστος' : [ u'-<{φαορ=η}σα', u'-<{φαορ=η}σες', u'-<{φαορ=η}σε', u'-{φαορ=η}>σαμε', u'-{φαορ=η}>σατε', [ u'-<{φαορ=η}σαν', u'-{φαορ=η}>σανε' ]],
      u'μέλλοντας' : [ u'-{φαορ=η}>σω', u'-{φαορ=η}>σεις', u'-{φαορ=η}>σει', u'-{φαορ=η}>σουμε', u'-{φαορ=η}>σετε', u'-{φαορ=η}>σουν' ],
      u'απαρέμφατο' : [ u'-{φαορ=η}>σει' ],
    }
  },
  u'θεωρούμαι' : {
    u'παθητική' : {
      u'ενεστώτας' : [ u'-ούμαι', u'-είσαι', u'-είται', [ u'-ούμαστε', u'-ώμεθα' ], [ u'-είστε', u'-είσθε' ], [ u'-ούνται', u'-ώνται' ] ],
      u'παρατατικός' : [ u'-ούμουν(α', u'-ούσουν(α', [ u'-ούνταν', u'-είτο' ], [ u'-ούμασταν', u'-ούμαστε', u'-ούμεθα' ], [ u'-ούσασταν', u'-ούσαστε', u'-είσθε' ], [ u'-όνταν(ε', u'-ούνταν', u'-όντουσαν', u'-ούντο' ] ],
      u'αόριστος' : [ u'-ήθ{θαορ!}ηκα', u'-ήθ{θαορ!}ηκες', u'-ήθ{θαορ!}ηκε', u'-ηθ{θαορ!}ήκαμε', u'-ηθ{θαορ!}ήκατε', [ u'-ήθ{θαορ!}ηκαν', u'-ηθ{θαορ!}ήκαν(ε' ]],
      u'μέλλοντας' : [ u'-ηθ{θαορ!}ώ', u'-ηθ{θαορ!}είς', u'-ηθ{θαορ!}εί', u'-ηθ{θαορ!}ούμε', u'-ηθ{θαορ!}είτε', u'-ηθ{θαορ!}ούν(ε' ],
      u'πρ1' : [ u'-ή{θαορ!}/σου' ],
      u'πρ2' : [ u'-ηθ{θαορ!}είτε' ],
      u'απαρέμφατο' : [ u'-ηθ{θαορ!}εί' ],
      u'μτχ' : [ u'-ημ{θαορ!}ένος' ],
      u'μτχ1=1' : [ u'-ούμενος' ],
    }
  },
  u'θεωρώ' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ώ', u'-είς', u'-εί', u'-ούμε', u'-είτε', u'-ούν' ],
      u'παρατατικός' : [ u'-ούσα', u'-ούσες', u'-ούσε', u'-ούσαμε', u'-ούσατε', u'-ούσαν' ],
      u'πρ2' : [ u'-είτε' ],
      u'πρ3' : [ u'-<ησε' ],
      u'πρ4' : [ u'-ήστε' ],
      u'μετοχή' : [ u'-ώντας' ],
      u'αόριστος' : [ u'-<ησα', u'-<ησες', u'-<ησε', u'-ήσαμε', u'-ήσατε', [ u'-<ησαν', u'-ήσανε' ]],
      u'μέλλοντας' : [ u'-ήσω', u'-ήσεις', u'-ήσει', u'-ήσουμε', u'-ήσετε', u'-ήσουν' ],
      u'απαρέμφατο' : [ u'-ήσει' ],
      u'μετοχή2' : [ u'-ών', u'-ήσας' ],
    }
  },
  u'ιδρύομαι' : {
    u'παθητική' : {
      u'ενεστώτας'  : [ u'-ομαι', u'-εσαι', u'-εται', u'-όμαστε', u'-εστε', u'-ονται' ],
      u'παρατατικός'  : [ u'-όμουν(α', u'-όσουν(α', u'-όταν(ε', u'-όμασταν', u'-όσασταν', [ u'-ονταν', u'-όντουσαν' ] ],
      u'αόριστος'    : [ u'-{χαορ=θ}ηκα', u'-{χαορ=θ}ηκες', u'-{χαορ=θ}ηκε', u'-{χαορ=θ}ήκαμε', u'-{χαορ=θ}ήκατε', [ u'-{χαορ=θ}ηκαν', u'-{χαορ=θ}ήκαν(ε' ]],
      u'μέλλοντας'    : [ u'-{χαορ=θ}ώ', u'-{χαορ=θ}είς', u'-{χαορ=θ}εί', u'-{χαορ=θ}ούμε', u'-{χαορ=θ}είτε', u'-{χαορ=θ}ούν(ε' ],
      u'προστ'  : [ u'-σου', u'-{χαορ=θ}είτε' ],
      u'απαρέμφατο' : [ u'-{χαορ=θ}εί' ],
      u'μτχ'    : [ u'-όμενος', u'-θείς', u'-{χμτχ=μ}ένος' ],
    }
  },
  u'καλώ' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ώ', u'-είς', u'-εί', u'-ούμε', u'-είτε', u'-ούν' ],
      u'παρατατικός' : [ u'-ούσα', u'-ούσες', u'-ούσε', u'-ούσαμε', u'-ούσατε', u'-ούσαν' ],
      u'πρ1' : [ u'-<ει' ],
      u'πρ2' : [ u'-είτε' ],
      u'πρ3' : [ u'-<εσε' ],
      u'πρ4' : [ u'-έστε' ],
      u'μετοχή' : [ u'-ώντας' ],
      u'αόριστος' : [ u'-<εσα', u'-<εσες', u'-<εσε', u'-έσαμε', u'-έσατε', [ u'-<εσαν', u'-έσανε' ]],
      u'μέλλοντας' : [ u'-έσω', u'-έσεις', u'-έσει', u'-έσουμε', u'-έσετε', u'-έσουν' ],
      u'απαρέμφατο' : [ u'-έσει' ],
    },
    u'παθητική' : {
      u'μτχ' : [ u'-εσμένος' ],
    }
  },
  u'καταπίνω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'1-ω', u'1-εις', u'1-ει', u'1-ουμε', u'1-ετε', u'1-ουν' ],
      u'παρατατικός' : [ u'2-α', u'2-ες', u'2-ε', u'1-αμε', u'1-ατε', [ u'2-αν', u'1-ανε' ] ],
      u'πρ1' : [ u'2-ε'  ],
      u'πρ2' : [ u'1-ετε' ],
      u'πρ3' : [ u'3-ές' ],
      u'πρ4' : [ u'3-είτε' ],
      u'μετοχή' : [ u'1-οντας', u'1-ων' ],
      u'αόριστος' : [ u'4-α', u'4-ες', u'4-ε', u'4-αμε', u'4-ατε', u'4-αν(ε' ],
      u'μέλλοντας' : [ u'3-ώ', u'3-είς', u'3-εί', u'3-ούμε', u'3-είτε', u'3-ούν(ε' ],
      u'απαρέμφατο' : [ u'3-εί' ],
    }
  },
  u'κρίνω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-νω', u'-νεις', u'-νει', u'-νουμε', u'-νετε', u'-νουν' ],
      u'παρατατικός' : [ u'έ+-να', u'έ+-νες', u'έ+-νε', u'-ναμε', u'-νατε', [ u'έ+-ναν', u'-ανε' ] ],
      u'πρ1' : [ u'-<ε' ],
      u'πρ2' : [ u'-ετε' ],
      u'πρ3' : [ u'-νε' ],
      u'πρ4' : [ u'-ντε' ],
      u'μετοχή' : [ u'-οντας', u'-ων' ],
      u'αόριστος' : [ u'έ+-να', u'έ+-νες', u'έ+-νε', u'-ναμε', u'-νατε', [ u'έ+-ναν', u'-νανε' ] ],
      u'μέλλοντας' : [ u'-νω', u'-νεις', u'-νει', u'-νουμε', u'-νετε', u'-νουν(ε' ],
      u'απαρέμφατο' : [ u'-νει' ],
    }
  },
  u'λαλώ' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'1-ώ', u'1-είς', u'1-εί', u'1-ούμε', u'1-είτε', u'1-ούν' ],
      u'παρατατικός' : [ u'1-ούσα', u'1-ούσες', u'1-ούσε', u'1-ούσαμε', u'1-ούσατε', u'1-ούσαν' ],
      u'πρ1' : [ u'2{3!}-ει' ],
      u'πρ2' : [ u'1-είτε' ],
      u'πρ3' : [ u'2{4!}-ησε' ],
      u'πρ4' : [ u'1-ήστε' ],
      u'μετοχή' : [ u'-ώντας' ],
      u'αόριστος' : [ u'2-ησα', u'2-ησες', u'2-ησε', u'1-ήσαμε', u'1-ήσατε', [ u'2-ησαν', u'1-ήσανε' ]],
      u'μέλλοντας' : [ u'1-ήσω', u'1-ήσεις', u'1-ήσει', u'1-ήσουμε', u'1-ήσετε', u'1-ήσουν' ],
      u'απαρέμφατο' : [ u'1-ήσει' ],
    }
  },
  u'λύω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ω', u'-εις', u'-ει', u'-ουμε', u'-ετε', u'-ουν' ],
      u'παρατατικός' : [ u'έ+-α', u'έ+-ες', u'έ+-ε', u'-αμε', u'-ατε', u'έ+-αν' ],
      u'πρ1' : [ u'-<ε' ],
      u'πρ2' : [ u'-ετε' ],
      u'πρ3' : [ u'-σε' ],
      u'πρ4' : [ u'-στε' ],
      u'μετοχή' : [ u'-οντας' ],
      u'αόριστος' : [ u'έ+-σα', u'έ+-σες', u'έ+-σε', u'-σαμε', u'-σατε', [ u'έ+-σαν', u'-σανε' ] ],
      u'μέλλοντας' : [ u'-σω', u'-σεις', u'-σει', u'-σουμε', u'-σετε', u'-σουν(ε' ],
      u'απαρέμφατο' : [ u'-σει' ],
    },
    u'παθητική' : {
      u'μτχ' : [ u'-μένος', u'-τός' ],
    }
  },
  u'λύνω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ω', u'-εις', u'-ει', u'-ουμε', u'-ετε', u'-ουν' ],
      u'παρατατικός' : [ u'έ+-α', u'έ+-ες', u'έ+-ε', u'-αμε', u'-ατε', [ u'έ+-αν', u'-ανε' ] ],
      u'πρ1' : [ u'-ε' ],
      u'πρ2' : [ u'-ετε' ],
      u'πρ3' : [ u'-σε' ],
      u'πρ4' : [ u'-στε', u'-σετε', u'-σατε' ],
      u'μετοχή' : [ u'-οντας' ],
      u'αόριστος' : [ u'έ+-σα', u'έ+-σες', u'έ+-σε', u'-σαμε', u'-σατε', [ u'έ+-σαν', u'-σανε' ] ],
      u'μέλλοντας' : [ u'-σω', u'-σεις', u'-σει', u'-σουμε', u'-σετε', u'-σουν(ε' ],
      u'απαρέμφατο' : [ u'-σει' ],
    },
    u'παθητική' : {
      u'μτχ' : [ u'-μένος', u'-τός' ],
    }
  },
  u'μιαίνομαι' : {
    u'παθητική' : {
      u'ενεστώτας' : [ u'-αίνομαι', u'-αίνεσαι', u'-αίνεται', u'-αινόμαστε', u'-αίνεστε', u'-αίνονται' ],
      u'παρατατικός' : [ u'-αινόμουν(α', u'-αινόσουν(α', u'-αινόταν(ε', u'-αινόμασταν', u'-αινόσασταν', [ u'-αίνονταν', u'-αινόντουσαν' ] ],
      u'αόριστος' : [ u'-άνθηκα', u'-άνθηκες', u'-άνθηκε', u'-ανθήκαμε', u'-ανθήκατε', [ u'-άνθηκαν', u'-/φτήκανε' ]],
      u'μέλλοντας' : [ u'-ανθώ', u'-ανθείς', u'-ανθεί', u'-ανθούμε', u'-ανθείτε', u'-ανθούν(ε' ],
      u'πρ1' : [ u'-αίνου' ],
      u'πρ2' : [ u'-αίνεστε' ],
      u'πρ4' : [ u'-ανθείτε' ],
      u'απαρέμφατο' : [ u'-ανθεί' ],
      u'μτχ' : [ u'-ασμένος' ],
    }
  },
  u'μπαίνω' : {
    u'process_args' : [ mpaino ],
    u'ενεργητική' : {
      u'ενεστώτας'  : [ u'-ω', u'-εις', u'-ει', u'-ουμε', u'-ετε', u'-ουν' ],
      u'παρατατικός'  : [ u'έ+-α', u'έ+-ες', u'έ+-ε', u'-αμε', u'-ατε', [ u'έ+-αν', u'-ανε' ] ],
      u'πρ1'    : [ u'-ε', u'έ-ε' ],
      u'πρ2'    : [ u'-ετε' ],
      u'μετοχή' : [ u'-οντας' ],
      u'αόριστος'    : [ u'-/ήκ{θαορ!}α', u'-/ήκ{θαορ!}ες', u'-/ήκ{θαορ!}ε', u'-/ήκ{θαορ!}αμε', u'-/ήκ{θαορ!}ατε', u'-/ήκ{θαορ!}αν(ε' ],
      u'μέλλοντας' : [ u'-/{θμελλ!}ω', u'-/{θμελλ!}εις', u'-/{θμελλ!}ει', u'-/{θμελλ!}ούμε', u'-/{θμελλ!}είτε', u'-/{θμελλ!}ουν' ],
      u'πρ3'    : [ u'-/{θμελλ!}ες' ],
      u'πρ4'    : [ u'-/{θμελλ!}είτε' ],
      u'απαρέμφατο' : [ u'-/{θμελλ!}ει' ],
    },
    u'παθητική' : {
      u'μτχ'    : [ u'-/α{χμτχ=σμ}ένος' ],
    }
  },
  u'νομίζω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ω', u'-εις', u'-ει', u'-ουμε', u'-ετε', u'-ουν' ],
      u'παρατατικός' : [ u'-<α', u'-<ες', u'-<ε', u'-αμε', u'-ατε', [ u'-<αν', u'-ανε' ] ],
      u'πρ1' : [ u'-<ε' ],
      u'πρ2' : [ u'-ετε' ],
      u'πρ3' : [ u'-</σε' ],
      u'πρ4' : [ u'-/στε' ],
      u'μετοχή' : [ u'-οντας' ],
      u'αόριστος' : [ u'-</σα', u'-</σες', u'-</σε', u'-/σαμε', u'-/σατε', [ u'-</σαν', u'-/σανε' ] ],
      u'μέλλοντας' : [ u'-/σω', u'-/σεις', u'-/σει', u'-/σουμε', u'-/σετε', u'-/σουν(ε' ],
      u'απαρέμφατο' : [ u'-/σει' ],
    },
    u'παθητική' : {
      u'παρακΒ=1' : [ u'-/σμένος' ],
    }
  },
  u'ομορφαίνω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-αίνω', u'-αίνεις', u'-αίνει', u'-αίνουμε', u'-αίνετε', u'-αίνουν' ],
      u'παρατατικός' : [ u'->αινα', u'->αινες', u'->αινε', u'-αίναμε', u'-αίνατε', [ u'->αιναν', u'-αίνανε' ] ],
      u'πρ1' : [ u'->αινε' ],
      u'πρ2' : [ u'-αίνετε' ],
      u'πρ3' : [ u'->υνε' ],
      u'πρ4' : [ u'-ύνετε' ],
      u'μετοχή' : [ u'-αίνοντας' ],
      u'αόριστος' : [ u'->υνα', u'->υνες', u'->υνε', u'-ύναμε', u'-ύνατε', [ u'->υναν', u'-ύνανε' ] ],
      u'μέλλοντας' : [ u'-ύνω', u'-ύνεις', u'-ύνει', u'-ύνουμε', u'-ύνετε', u'-ύνουν' ],
      u'απαρέμφατο' : [ u'-ύνει' ],
    }
  },
  u'οξύνω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ω', u'-εις', u'-ει', u'-ουμε', u'-ετε', u'-ουν' ],
      u'παρατατικός' : [ u'-<α', u'-<ες', u'-<ε', u'-αμε', u'-ατε', [ u'-<αν', u'-ανε' ] ],
      u'πρ1' : [ u'-<ε' ],
      u'πρ2' : [ u'-ετε' ],
      u'πρ3' : [ u'-<ε' ],
      u'πρ4' : [ u'-<ε' ],
      u'μετοχή' : [ u'-οντας', u'-ων' ],
      u'αόριστος' : [ u'-<α', u'-<ες', u'-<ε', u'-αμε', u'-ατε', [ u'-<αν', u'-ανε' ] ],
      u'μέλλοντας' : [ u'-ω', u'-εις', u'-ει', u'-ουμε', u'-ετε', u'-ουν(ε' ],
      u'απαρέμφατο' : [ u'-ει' ],
    }
  },
  u'ξέρω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ω', u'-εις', u'-ει', u'-ουμε', u'-ετε', u'-ουν' ],
      u'παρατατικός' : [ u'ή+{2!}-α', u'ή+{2!}-ες', u'ή+{2!}-ε', u'{3!}-αμε', u'{3!}-ατε', [ u'ή+{2!}-αν', u'{3!}-ανε' ] ],
      u'πρ1' : [ u'-<ε' ],
      u'πρ2' : [ u'-ετε' ],
      u'μετοχή' : [ u'-οντας' ],
    }
  },
  u'παντρεύομαι' : {
    u'παθητική' : {
      u'ενεστώτας' : [ u'-εύομαι', u'-εύεσαι', u'-εύεται', u'-ευόμαστε', [ u'-ευόσαστε', u'-εύεστε' ], u'-εύονται' ],
      u'παρατατικός' : [ u'-ευόμουν(α', u'-ευόσουν(α', u'-ευόταν(ε', u'-ευόμασταν', u'-ευόσασταν', [ u'-εύονταν', u'-ευόντουσαν' ] ],
      u'μετοχή' : [ u'-εύοντας' ],
      u'αόριστος' : [ u'-εύτηκα', u'-εύτηκες', u'-εύτηκε', u'-ευτήκαμε', u'-ευτήκατε', [ u'-εύτηκαν', u'-ευτήκανε' ]],
      u'μέλλοντας' : [ u'-ευτώ', u'-ευτείς', u'-ευτεί', u'-ευτούμε', u'-ευτείτε', u'-ευτούν(ε' ],
      u'πρ1' : [ u'-έψου' ],
      u'πρ2' : [ u'-ευτείτε' ],
      u'πρ4' : [ u'-εύεστε' ],
      u'απαρέμφατο' : [ u'-ευτεί' ],
      u'μτχ' : [ u'-εμένος' ],
    }
  },
  u'παντρεύω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-εύω', u'-εύεις', u'-εύει', u'-εύουμε', u'-εύετε', u'-εύουν' ],
      u'παρατατικός' : [ u'-<ευα', u'-<ευες', u'-<ευε', u'-εύαμε', u'-εύατε', [ u'-<ευαν', u'-εύανε' ] ],
      u'πρ1' : [ u'-<ευε' ],
      u'πρ2' : [ u'-εύετε' ],
      u'μετοχή' : [ u'-εύοντας' ],
      u'αόριστος' : [ u'-<εψα', u'-<εψες', u'-<εψε', u'-έψαμε', u'-έψατε', [ u'-<εψαν', u'-έψαν(ε' ] ],
      u'μέλλοντας' : [ u'-έψω', u'-έψεις', u'-έψει', u'-έψουμε', u'-έψετε', u'-έψουν(ε' ],
      u'προστ2' : [ u'-εψε', u'-έψετε' ],
      u'απαρέμφατο' : [ u'-έψει' ],
    },
    u'παθητική' : {
      u'μτχ' : [ u'-{xμτχ=εμ}ένος' ],
    }
  },
  u'πηγαίνω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'1-ω', u'1-εις', u'1-ει', u'1-ουμε', u'1-ετε', u'1-ουν' ],
      u'παρατατικός' : [ u'-<α', u'-<ες', u'-<ε', u'-αμε', u'-ατε', [ u'-<αν', u'-ανε' ] ],
      u'πρ1' : [ u'4-ε' ],
      u'πρ2' : [ u'1-ετε' ],
      u'πρ3' : [ u'2-νε' ],
      u'πρ4' : [ u'2-τε' ],
      u'μετοχή' : [ u'1-οντας' ],
      u'αόριστος' : [ u'5-α', u'5-ες', u'5-ε', u'5-αμε', u'5-ατε', u'5-αν(ε' ],
      u'μέλλοντας' : [ u'2-ω', u'3-ς', u'2-ει', u'2-με', u'2-τε', u'2-άνε' ],
      u'απαρέμφατο' : [ u'2-ει' ],
    }
  },
  u'πλέκομαι' : {
    u'παθητική' : {
      u'ενεστώτας' : [ u'-ομαι', u'-εσαι', u'-εται', u'-όμαστε', u'-εστε', u'-ονται' ],
      u'παρατατικός' : [ u'-όμουν(α', u'-όσουν(α', u'-όταν(ε', u'-όμασταν', u'-όσασταν', [ u'-ονταν', u'-όντουσαν' ] ],
      u'αόριστος' : [ u'-/{χαορ=χτ}ηκα', u'-/{χαορ=χτ}ηκες', u'-/{χαορ=χτ}ηκε', u'-/{χαορ=χτ}ήκαμε', u'-/{χαορ=χτ}ήκατε', [ u'-/{χαορ=χτ}ηκαν', u'-/{χαορ=χτ}ήκανε' ]],
      u'αόριστος2' : [ u'-/{χαορ=χθ}ηκα', u'-/{χαορ=χθ}ηκες', u'-/{χαορ=χθ}ηκε', u'-/{χαορ=χθ}ήκαμε', u'-/{χαορ=χθ}ήκατε', [ u'-/{χαορ=χθ}ηκαν', u'-/{χαορ=χθ}ήκανε' ]],
      u'μέλλοντας' : [ u'-/{χαορ=χτ}ώ', u'-/{χαορ=χτ}είς', u'-/{χαορ=χτ}εί', u'-/{χαορ=χτ}ούμε', u'-/{χαορ=χτ}είτε', u'-/{χαορ=χτ}ούν(ε' ],
      u'μέλλοντας2' : [ u'-/{χαορ=χθ}ώ', u'-/{χαορ=χθ}είς', u'-/{χαορ=χθ}εί', u'-/{χαορ=χθ}ούμε', u'-/{χαορ=χθ}είτε', u'-/{χαορ=χθ}ούν(ε' ],
      u'πρ1' : [ u'-ου' ],
      u'πρ2' : [ u'-εστε' ],
      u'πρ3' : [ u'-/{σ=ξ}ου' ],
      u'πρ4' : [ u'-/{χαορ=χτ}είτε' ],
      u'απαρέμφατο' : [ u'-/{χαορ=χτ}εί' ],
      u'μτχ' : [ u'-/{χμτχ=γμ}ένος' ],
    }
  },
  u'πλέκω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ω', u'-εις', u'-ει', u'-ουμε', u'-ετε', u'-ουν' ],
      u'παρατατικός' : [ u'έ+-α', u'έ+-ες', u'έ+-ε', u'-αμε', u'-ατε', u'έ+-αν', u'-ανε' ],
      u'πρ1' : [ u'-ε' ],
      u'πρ2' : [ u'-ετε' ],
      u'πρ3' : [ u'έ+-/ξε' ],
      u'πρ4' : [ u'-/ξετε' ],
      u'μετοχή' : [ u'-οντας' ],
      u'αόριστος' : [ u'έ+-/ξα', u'έ+-/ξες', u'έ+-/ξε', u'-/ξαμε', u'-/ξατε', [ u'έ+-/ξαν', u'-/ξαν(ε' ] ],
      u'μέλλοντας' : [ u'-/ξω', u'-/ξεις', u'-/ξει', u'-/ξουμε', u'-/ξετε', u'-/ξουν(ε' ],
      u'απαρέμφατο' : [ u'-/ξει' ],
    },
    u'παθητική' : {
      u'παρακΒ=1' : [ u'-/{χμτχ=γμ}ένος' ],
    }
  },
  u'προβαίνω' : {
    u'process_args' : [ filter_accent3 ],
    u'ενεργητική' : {
      u'ενεστώτας'    : [ u'1-ω', u'1-εις', u'1-ει', u'1-ουμε', u'1-ετε', u'1-ουν' ],
      u'παρατατικός'  : [ u'2-α', u'2-ες', u'2-ε', u'1-αμε', u'1-ατε', [ u'2-αν', u'1-ανε' ] ],
      u'πρ1'          : [ u'2-ε' ],
      u'πρ2'          : [ u'1-ετε' ],
      u'πρ3'          : [ u'4-α' ],
      u'πρ4'          : [ u'3-{pr4=εί}τε' ],
      u'μετοχή'       : [ u'1-οντας' ],
      u'αόριστος'     : [ u'4-ην', u'4-ης', u'4-η', u'3-ήκαμε', u'3-ήκατε', [ u'4-ησαν', u'3-ήκανε' ] ],
      u'μέλλοντας'    : [ u'3-ω', u'3-εις', u'3-ει', u'3-ουμε', u'3-ετε', u'3-ουν(ε' ],
      u'απαρέμφατο'   : [ u'3-ει' ],
    }
  },
  u'προστατεύομαι' : {
    u'παθητική' : {
      u'ενεστώτας' : [ u'-εύομαι', u'-εύεσαι', u'-εύεται', u'-ευόμαστε', [ u'-ευόσαστε', u'-εύεστε' ], u'-εύονται' ],
      u'παρατατικός' : [ u'-ευόμουν(α', u'-ευόσουν(α', u'-ευόταν(ε', u'-ευόμασταν', u'-ευόσασταν', [ u'-εύονταν', u'-ευόντουσαν' ] ],
      u'μετοχή' : [ u'-εύοντας' ],
      u'αόριστος' : [ u'-εύτηκα', u'-εύτηκες', u'-εύτηκε', u'-ευτήκαμε', u'-ευτήκατε', [ u'-εύτηκαν', u'-ευτήκανε' ]],
      u'μέλλοντας' : [ u'-ευτώ', u'-ευτείς', u'-ευτεί', u'-ευτούμε', u'-ευτείτε', u'-ευτούν(ε' ],
      u'πρ1' : [ u'-έψου' ],
      u'πρ2' : [ u'-ευτείτε' ],
      u'πρ4' : [ u'-εύεστε' ],
      u'απαρέμφατο' : [ u'-ευτεί' ],
      u'μτχ' : [ u'-ευμένος' ],
      u'μτχ1=1' : [ u'-ευόμένος' ],
    }
  },
  u'προστατεύω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-εύω', u'-εύεις', u'-εύει', u'-εύουμε', u'-εύετε', u'-εύουν' ],
      u'παρατατικός' : [ u'-<ευα', u'-<ευες', u'-<ευε', u'-εύαμε', u'-εύατε', [ u'-<ευαν', u'-εύανε' ] ],
      u'πρ1' : [ u'-<ευε' ],
      u'πρ2' : [ u'-εύετε' ],
      u'πρ3' : [ u'-εψε' ],
      u'πρ4' : [ u'-έψετε' ],
      u'μετοχή' : [ u'-εύοντας' ],
      u'αόριστος' : [ u'-<εψα', u'-<εψες', u'-<εψε', u'-έψαμε', u'-έψατε', [ u'-<εψαν', u'-έψαν(ε' ] ],
      u'μέλλοντας' : [ u'-έψω', u'-έψεις', u'-έψει', u'-έψουμε', u'-έψετε', u'-έψουν(ε' ],
      u'απαρέμφατο' : [ u'-έψει' ],
    },
    u'παθητική' : {
      u'μτχ' : [ u'-ευμένος' ],
    }
  },
  u'ράβομαι' : {
    u'παθητική' : {
      u'ενεστώτας' : [ u'-ομαι', u'-εσαι', u'-εται', u'-όμαστε', u'-εστε', u'-ονται' ],
      u'παρατατικός' : [ u'-όμουν(α', u'-όσουν(α', u'-όταν(ε', u'-όμασταν', u'-όσασταν', [ u'-ονταν', u'-όντουσαν' ] ],
      u'αόριστος' : [ u'-/{χαορ=φτ}ηκα', u'-/{χαορ=φτ}ηκες', u'-/{χαορ=φτ}ηκε', u'-/{χαορ=φτ}ήκαμε', u'-/{χαορ=φτ}ήκατε', [ u'-/{χαορ=φτ}ηκαν', u'-/{χαορ=φτ}ήκανε' ]],
      u'μέλλοντας' : [ u'-/{χαορ=φτ}ώ', u'-/{χαορ=φτ}είς', u'-/{χαορ=φτ}εί', u'-/{χαορ=φτ}ούμε', u'-/{χαορ=φτ}είτε', u'-/{χαορ=φτ}ούν(ε' ],
      u'πρ3' : [ u'-/ψου' ],
      u'πρ4' : [ u'-/{χαορ=φτ}είτε' ],
      u'απαρέμφατο' : [ u'-/{χαορ=φτ}εί' ],
      u'μτχ' : [ u'-/μμένος' ],
      u'μτχ1=1' : [ u'-όμενος' ],
    }
  },
  u'ράβω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ω', u'-εις', u'-ει', u'-ουμε', u'-ετε', u'-ουν' ],
      u'παρατατικός' : [ u'έ+-α', u'έ+-ες', u'έ+-ε', u'-αμε', u'-ατε', [u'έ+-αν', u'-ανε'] ],
      u'πρ1' : [ u'-ε' ],
      u'πρ2' : [ u'-ετε' ],
      u'πρ3' : [ u'έ+-/ψε' ],
      u'πρ4' : [ u'-/ψετε' ],
      u'μετοχή' : [ u'-οντας' ],
      u'αόριστος' : [ u'έ+-/ψα', u'έ+-/ψες', u'έ+-/ψε', u'-/ψαμε', u'-/ψατε', [ u'έ+-/ψαν', u'-/ψαν(ε' ] ],
      u'μέλλοντας' : [ u'-/ψω', u'-/ψεις', u'-/ψει', u'-/ψουμε', u'-/ψετε', u'-/ψουν(ε' ],
      u'απαρέμφατο' : [ u'-/ψει' ],
    }
  },
  u'σημαίνω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-αίνω', u'-αίνεις', u'-αίνει', u'-αίνουμε', u'-αίνετε', u'-αίνουν' ],
      u'παρατατικός' : [ u'-<αινα', u'-<αινες', u'-<αινε', u'-αίναμε', u'-αίνατε', [ u'-<αιναν', u'-αίνανε' ] ],
      u'πρ1' : [ u'-<αινε' ],
      u'πρ2' : [ u'-αίνετε' ],
      u'πρ3' : [ u'-{σ=άν}<ε' ],
      u'πρ4' : [ u'-{σ=άν}ετε' ],
      u'μετοχή' : [ u'-αίνοντας' ],
      u'αόριστος' : [ u'-{σ=άν}α', u'-{σ=άν}<ες', u'-{σ=άν}<ε', u'-{σ=άν}αμε', u'-{σ=άν}ατε', [ u'-{σ=άν}<αν', u'-{σ=άν}ανε' ] ],
      u'μέλλοντας' : [ u'-{σ=άν}ω', u'-{σ=άν}εις', u'-{σ=άν}ει', u'-{σ=άν}ουμε', u'-{σ=άν}ετε', u'-{σ=άν}ουν' ],
      u'απαρέμφατο' : [ u'-{σ=άν}ει' ],
    },
    u'παθητική' : {
      u'παρακΒ=1' : [ u'-/{χμτχ=σμ}ένος' ],
    },
  },
  u'σπάω' : {
    u'process_args' : [ spao ],
    u'ενεργητική' : {
      u'ενεστώτας'  : [ u'-ω', u'-ς', u'-ει', u'-με', u'-τε', u'-νε' ],
      u'παρατατικός'  : [ u'έ+-γα', u'έ+-γες', u'έ+-γε', u'-γαμε', u'-γατε', [ u'έ+-γαν', u'-γαν(ε', u'-/ούσαν(ε' ] ],
      u'πρ1'    : [ u'-γε' ],
      u'πρ2'    : [ u'-γετε' ],
      u'πρ3'    : [ u'-σε' ],
      u'πρ4'    : [ u'-στε' ],
      u'μετοχή' : [ u'-γοντας' ],
      u'αόριστος'  : [ u'έ+-σα', u'έ+-σες', u'έ+-σε', u'-σαμε', u'-σατε', [ u'έ+-σαν', u'-σαν(ε' ] ],
      u'μέλλοντας' : [ u'-σω', u'-σεις', u'-σει', u'-σουμε', u'-σετε', u'-σουν(ε' ],
      u'απαρέμφατο' : [ u'-σει' ],
    }
  },
  u'σώζω' : {
    u'ενεργητική' : {
      u'ενεστώτας'  : [ u'-ω', u'-εις', u'-ει', u'-ουμε', u'-ετε', u'-ουν' ],
      u'παρατατικός'  : [ u'έ+-α', u'έ+-ες', u'έ+-ε', u'-αμε', u'-ατε', [ u'έ+-αν', u'-αν(ε' ] ],
      u'πρ1'    : [ u'-ε' ],
      u'πρ2'    : [ u'-ετε' ],
      u'πρ3'    : [ u'έ+-/{σ=σ}ε' ],
      u'πρ4'    : [ u'-/{σ=σ}ετε' ],
      u'μετοχή' : [ u'-οντας' ],
      u'αόριστος'    : [ u'έ+-/{σ=σ}α', u'έ+-/{σ=σ}ες', u'έ+-/{σ=σ}ε', u'-/{σ=σ}αμε', u'-/{σ=σ}ατε', [ u'έ+-/{σ=σ}αν', u'-/{σ=σ}αν(ε' ] ],
      u'μέλλοντας' : [ u'-/{σ=σ}ω', u'-/{σ=σ}εις', u'-/{σ=σ}ει', u'-/{σ=σ}ουμε', u'-/{σ=σ}ετε', u'-/{σ=σ}ουν(ε' ],
      u'απαρέμφατο' : [ u'-/{σ=σ}ει' ],
    },
    u'παθητική' : {
      u'παρακΒ=1' : [ u'-/{χμτχ=σμ}ένος' ],
    }
  },
  u'τελούμαι' : {
    u'παθητική' : {
      u'ενεστώτας' : [ u'-ούμαι', u'-είσαι', u'-είται', u'-ούμαστε', u'-είστε', u'-ούνται' ],
      u'παρατατικός' : [ u'-ούμουν', u'-ούσουν', u'-ούνταν', [ u'-ούμασταν', u'-ούμαστε' ], [ u'-ούσασταν', u'-ούσαστε' ], u'-ούνταν' ],
      u'αόριστος' : [ u'-έ{χαορ=στ}ηκα', u'-έ{χαορ=στ}ηκες', u'-έ{χαορ=στ}ηκε', u'-ε{χαορ=στ}ήκαμε', u'-ε{χαορ=στ}ήκατε', [ u'-έ{χαορ=στ}ηκαν', u'-ε{χαορ=στ}ήκανε' ] ],
      u'μέλλοντας' : [ u'-ε{χαορ=στ}ώ', u'-ε{χαορ=στ}είς', u'-ε{χαορ=στ}εί', u'-ε{χαορ=στ}ούμε', u'-ε{χαορ=στ}είτε', u'-ε{χαορ=στ}ούν' ],
      u'πρ3' : [ u'-έσου' ],
      u'πρ4' : [ u'-ε{χαορ=στ}είτε' ],
      u'απαρέμφατο' : [ u'-ε{χαορ=στ}εί' ],
      u'μτχ1=1' : [ u'-ούμενος' ],
      u'μτχ' : [ u'-εσμένος' ],
    }
  },
  u'τελώ' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ u'-ώ', u'-είς', u'-εί', u'-ούμε', u'-είτε', u'-ούν' ],
      u'παρατατικός' : [ u'-ούσα', u'-ούσες', u'-ούσε', u'-ούσαμε', u'-ούσατε', u'-ούσαν' ],
      u'αόριστος' : [ u'-<εσα', u'-<εσες', u'-<εσε', u'-έσαμε', u'-έσατε', [ u'-<εσαν', u'-έσανε' ]],
      u'μέλλοντας' : [ u'-έσω', u'-έσεις', u'-έσει', u'-έσουμε', u'-έσετε', u'-έσουν(ε' ],
      u'μετοχή' : [ u'-ώντας' ],
      u'πρ1' : [ u'-<ει' ],
      u'πρ2' : [ u'-είτε' ],
      u'πρ3' : [ u'-<εσε' ],
      u'πρ4' : [ u'-έστε' ],
      u'απαρέμφατο' : [ u'-έσει' ],
    },
    u'παθητική' : {
      u'μτχ' : [ u'-εσμένος' ],
    }
  },
  u'τρελαίνομαι' : {
    u'process_args' : [ default_args({u'χαρ' : u'3', u'χαόριστος' : u'άθ', u'σ' : u'άσ', u'χμτχ' : u'αμ'}) ],
    u'παθητική' : {
      u'ενεστώτας' : [ u'-ομαι', u'-εσαι', u'-εται', u'-όμαστε', u'-εστε', u'-ονται' ],
      u'παρατατικός' : [ u'-όμουν(α', u'-όσουν(α', u'-όταν(ε', [ u'-όμασταν', u'-όμαστε' ], [ u'-όσασταν', u'-όσαστε' ], [ u'-ονταν', u'-όντουσαν' ] ],
      u'αόριστος' : [ u'-/άθηκα', u'-άθηκες', u'-άθηκε', u'-αθήκαμε', u'-αθήκατε', [ u'-άθηκαν', u'-αθήκαν(ε' ]],
      u'μέλλοντας' : [ u'-αθώ', u'-αθείς', u'-θεί', u'-αθούμε', u'-αθείτε', u'-αθούν(ε' ],
      u'πρ1' : [ u'-ου' ],
      u'πρ2' : [ u'-εστε' ],
      u'πρ3' : [ u'-άσου' ],
      u'πρ4' : [ u'-αθείτε' ],
      u'απαρέμφατο' : [ u'-αθεί' ],
      u'μτχ' : [ u'-αμένος' ],
    }
  },
  u'τρώω' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ [ u'1-ω', u'1-γω' ], u'2-ς', u'1-ει', u'1-με', u'1-τε', u'1-νε' ],
      u'παρατατικός' : [ u'έ+4-γα', u'έ+4-γες', u'έ+4-γε', u'3-γαμε', u'3-γατε', [ u'έ+4-γαν', u'3-γαν(ε' ] ],
      u'μετοχή' : [ u'1-γοντας' ],
      u'αόριστος' : [ u'έ+4+γα', u'έ+4-γες', u'έ+4-γε', u'3-γαμε', u'3-γατε', [ u'έ+4-γαν', u'3-γαν(ε' ] ],
      u'μέλλοντας' : [ u'3-ω', u'4-ς', u'3-ει', u'3-με', u'3-τε', u'3-νε' ],
      u'πρ1' : [ u'3-γε' ],
      u'πρ2' : [ u'3-γετε' ],
      u'πρ3' : [ u'3-ε' ],
      u'πρ4' : [ u'3-τε' ],
      u'απαρέμφατο' : [ u'3-ει' ],
    }
  },
  u'φοβάμαι' : {
    u'παθητική' : {
      u'ενεστώτας' : [ [ u'-άμαι', u'-ούμαι' ], u'-άσαι', u'-άται', [ u'-όμαστε', u'-ούμαστε' ], u'-άστε', u'-ούνται' ],
      u'παρατατικός' : [ u'-όμουν(α', u'-όσουν(α', u'-όταν(ε', [ u'-όμασταν', u'-όμαστε' ], [ u'-όσασταν', u'-όσαστε' ], [ u'-ούνταν', u'-όντουσαν' ] ],
      u'αόριστος' : [ u'-ήθηκα', u'-ήθηκες', u'-ήθηκε', u'-ηθήκαμε', u'-ηθήκατε', [ u'-ήθηκαν', u'-ηθήκανε' ]],
      u'μέλλοντας' : [ u'-ηθώ', u'-ηθείς', u'-ηθεί', u'-ηθούμε', u'-ηθείτε', u'-ηθούν(ε' ],
      u'πρ1' : [ u'-ήσου' ],
      u'πρ2' : [ u'-ηθείτε' ],
      u'απαρέμφατο' : [ u'-ηθεί' ],
      u'μτχ' : [ u'-ισμένος' ],
      u'μτχ1=1' : [ u'-ούμενος' ],
    }
  },
  u'χρωστώ' : {
    u'ενεργητική' : {
      u'ενεστώτας' : [ [ u'-ώ', u'-άω' ], u'-άς', [ u'-ά', u'-άει' ], [ u'-ούμε', u'-άμε' ], u'-άτε', [ u'-ούν', u'-άνε' ] ],
      u'παρατατικός' : [ u'-ούσα', u'-ούσες', u'-ούσε', u'-ούσαμε', u'-ούσατε', u'-ούσαν' ],
      u'πρ1' : [ u'-<α' ],
      u'πρ2' : [ u'-άτε' ],
      u'μετοχή' : [ u'-ώντας' ],
    }
  },
  u'ψηφίζομαι' : {
    u'παθητική' : {
      u'ενεστώτας' : [ u'-ομαι', u'-εσαι', u'-εται', u'-όμαστε', u'-εστε', u'-ονται' ],
      u'παρατατικός' : [ u'-όμουν(α', u'-όσουν(α', u'-όταν(ε', [ u'-όμασταν', u'-όμαστε' ], [ u'-όσασταν', u'-όσαστε' ], [ u'-ονταν', u'-όντουσαν' ] ],
      u'πρ1' : [ u'-ου' ],
      u'πρ2' : [ u'-εστε' ],
      u'πρ3' : [ u'-/{σ=σ}ου' ],
      u'πρ4' : [ u'-/{χαορ=στ}είτε' ],
      u'αόριστος' : [ u'-/{χαορ=στ}ηκα', u'-/{χαορ=στ}ηκες', u'-/{χαορ=στ}ηκε', u'-/{χαορ=στ}ήκαμε', u'-/{χαορ=στ}ήκατε', [ u'-/{χαορ=στ}ηκαν', u'-/{χαορ=στ}ήκαν(ε' ]],
      u'μέλλοντας' : [ u'-/{χαορ=στ}ώ', u'-/{χαορ=στ}είς', u'-/{χαορ=στ}εί', u'-/{χαορ=στ}ούμε', u'-/{χαορ=στ}είτε', u'-/{χαορ=στ}ούν(ε' ],
      u'απαρέμφατο' : [ u'-/{χαορ=στ}εί' ],
      u'μτχ' : [ u'-/{χμτχ=σμ}ένος' ],
      u'μτχ1=1' : [ u'-όμενος' ],
    }
  },
}

merged_letters = {
  u'ψσ': u'ψ',
  u'πσ': u'ψ',
  u'ξσ': u'ξ',
  u'κσ': u'ξ',
  u'ζσ': u'σ',
  u'γσ': u'ζ'
}

pos = {
  u'άρθρο|el'             : u'Αρθ',
  u'κύριο όνομα|el'       : u'Όνο',
  u'ρήμα|el'              : u'Ρήμ',
  u'ουσιαστικό|el'        : u'Ουσ',
  u'επίρρημα|el'          : u'Επρ',
  u'πρόθεση|el'           : u'Πρό',
  u'αντωνυμία|el'         : u'Αντ',
  u'αριθμητικό|el'        : u'Αρι',
  u'σύνδεσμος|el'         : u'Συν',
  u'μόριο|el'             : u'Μόρ',
  u'επιφώνημα|el'         : u'Επι',
  u'πρόθημα|el'           : u'Πρθ',
  u'επίθημα|el'           : u'Επθ',
  u'επίθετο|el'           : u'Επί',
  u'συντομομορφή|el'      : u'Σντ',
  u'μετοχή|el'            : u'Μτχ',
  u'μορφή επιθέτου|el'    : u'Επί',
  u'μορφή ρήματος|el'     : u'Ρήμ',
  u'μορφή ουσιαστικού|el' : u'Ουσ',
  u'μορφή αντωνυμίας|el'  : u'Αντ',
  u'μορφή μετοχής|el'     : u'Μτχ',
  u'{{α}}'                : u'αρσ',
  u'{{θ}}'                : u'θηλ',
  u'{{ο}}'                : u'ουδ',
  u'{{χυδ}}'              : u'χυδ',
  u'{{υβριστ}}'           : u'χυδ',
  u'{{ανεπ}}'             : u'χυδ',
}

pos_cases = {
  u'πτώσηΑεν'             : [[u'αιτιατική', u'ενικός']],

  u'αρσ_του-πτώσειςΟΑΚεν' : [[u'ονομαστική', u'ενικός', u'αρσ'],
                             [u'αιτιατική', u'ενικός', u'αρσ'],
                             [u'κλητική', u'ενικός', u'αρσ']],
  u'αρσ_του-πτώσειςΟΑεν'  : [[u'ονομαστική', u'ενικός', u'αρσ'],
                             [u'αιτιατική', u'ενικός', u'αρσ']],
  u'αρσ_του-πτώσηΓεν'     : [[u'γενική', u'ενικός', u'αρσ']],
  u'αρσ_του-πτώσειςΟΑΚπλ' : [[u'ονομαστική', u'πληθυντικός', u'αρσ'],
                             [u'αιτιατική', u'πληθυντικός', u'αρσ'],
                             [u'κλητική', u'πληθυντικός', u'αρσ']],
  u'αρσ_του-πτώσειςΟΑπλ'  : [[u'ονομαστική', u'πληθυντικός', u'αρσ'],
                             [u'αιτιατική', u'πληθυντικός', u'αρσ']],
  u'αρσ_του-πτώσηΓπλ'     : [[u'γενική', u'πληθυντικός', u'αρσ']],

  u'θηλ_του-πτώσειςΟΑΚεν' : [[u'ονομαστική', u'ενικός', u'θηλ'],
                             [u'αιτιατική', u'ενικός', u'θηλ'],
                             [u'κλητική', u'ενικός', u'θηλ']],
  u'θηλ_του-πτώσειςΟΑεν'  : [[u'ονομαστική', u'ενικός', u'θηλ'],
                             [u'αιτιατική', u'ενικός', u'θηλ']],
  u'θηλ_του-πτώσηΓεν'     : [[u'γενική', u'ενικός', u'θηλ']],
  u'θηλ_του-πτώσειςΟΑΚπλ' : [[u'ονομαστική', u'πληθυντικός', u'θηλ'],
                             [u'αιτιατική', u'πληθυντικός', u'θηλ'],
                             [u'κλητική', u'πληθυντικός', u'θηλ']],
  u'θηλ_του-πτώσειςΟΑπλ'  : [[u'ονομαστική', u'πληθυντικός', u'θηλ'],
                             [u'αιτιατική', u'πληθυντικός', u'θηλ']],
  u'θηλ_του-πτώσηΓπλ'     : [[u'γενική', u'πληθυντικός', u'θηλ']],

  u'ουδ_του-πτώσειςΟΑΚεν' : [[u'ονομαστική', u'ενικός', u'ουδ'],
                             [u'αιτιατική', u'ενικός', u'ουδ'],
                             [u'κλητική', u'ενικός', u'ουδ']],
  u'ουδ_του-πτώσειςΟΑεν'  : [[u'ονομαστική', u'ενικός', u'ουδ'],
                             [u'αιτιατική', u'ενικός', u'ουδ']],
  u'ουδ_του-πτώσηΓεν'     : [[u'γενική', u'ενικός', u'ουδ']],
  u'ουδ_του-πτώσειςΟΑΚπλ' : [[u'ονομαστική', u'πληθυντικός', u'ουδ'],
                             [u'αιτιατική', u'πληθυντικός', u'ουδ'],
                             [u'κλητική', u'πληθυντικός', u'ουδ']],
  u'ουδ_του-πτώσειςΟΑπλ'  : [[u'ονομαστική', u'πληθυντικός', u'ουδ'],
                             [u'αιτιατική', u'πληθυντικός', u'ουδ']],
  u'ουδ_του-πτώσηΓπλ'     : [[u'γενική', u'πληθυντικός', u'ουδ']],
}

redirections = [
  #u'βλέπε',
  #u'συντομομορφή|el',
  u'συνώνυμα|el',
  u'συνώνυμα',
  u'ταυτόσημα',
  u'μορφή επιθέτου|el',
  u'μορφή ρήματος|el',
  u'μορφή ουσιαστικού|el',
  u'μορφή αντωνυμίας|el',
  u'μορφή μετοχής|el',
]

class StemError(Exception):
  def __init__(self, msg):
    self.msg = msg
  def __str__(self):
    return repr(self.msg)

def has_accent(word):
  for bigram in deaccent_bigrams:
    if bigram in word:
      return True
  for letter in deaccent_letters:
    if letter in word:
      return True
  return False

def deaccent(word):
  if len(word) == 0: return u''
  if len(word) == 1: return deaccent_letters.get(word, word)
  bigram = word[0:2]
  if bigram in deaccent_bigrams:
    return deaccent_bigrams[bigram]+word[2:]
  elif word[0] in deaccent_letters:
    return deaccent_letters[word[0]]+word[1:]
  else:
    return word[0] + deaccent(word[1:])

def accent_index(word):
  for c in deaccent_bigrams:
    if c in word:
      return word.index(c)
  for c in deaccent_letters:
    if c in word:
      return word.index(c)
  raise StemError(u"Cannot move accent if it's not there")

def accent_left(word):
  try:
    i = accent_index(word) - 1
    while i >= 0:
      if i-1 >= 0:
        if word[i-1:i+1] in accent_bigrams:
          word = deaccent(word)
          word = word[:i-1] + accent_bigrams[word[i-1:i+1]] + word[i+1:]
          return word
      if word[i] in accent_letters:
        word = deaccent(word)
        word = u''.join([word[:i], accent_letters[word[i]], word[i+1:]])
        return word
      i -= 1
    return word
  except StemError:
    for i in range(len(word)-1, -1, -1):
      if word[i:i+2] in accent_bigrams:
        word = deaccent(word)
        word = u''.join([word[:i], accent_bigrams[word[i:i+2]], word[i+2:]])
        return word
      if word[i] in accent_letters:
        word = deaccent(word)
        word = u''.join([word[:i], accent_letters[word[i]], word[i+1:]])
        return word
    raise

def accent_right(word):
  try:
    i = accent_index(word) + 1
    while i < len(word):
      if i+2 <= len(word):
        if word[i:i+2] in accent_bigrams:
          word = deaccent(word)
          word = word[:i] + accent_bigrams[word[i:i+2]] + word[i+2:]
          return word
      if word[i] in accent_letters:
        word = deaccent(word)
        word = word[:i] + accent_letters[word[i]] + word[i+1:]
        return word
      i += 1
    return word
  except StemError:
    for i in range(len(word)-1, -1, -1):
      if word[i:i+2] in accent_bigrams:
        word = deaccent(word)
        word = u''.join([word[:i], accent_bigrams[word[i:i+2]], word[i+2:]])
        return word
      if word[i] in accent_letters:
        word = deaccent(word)
        word = u''.join([word[:i], accent_letters[word[i]], word[i+1:]])
        return word
    raise


def find_stem(word, endings, args):
  if endings is None: return None
  if isinstance(endings, dict):
    endings = endings.values()
  for ending in endings:
    if isinstance(ending, basestring):
      if u'-' in ending:
        ending = ending.split(u'-')[1]
      if u'=' in ending:
        ending = ending.split(u'=')[1].strip(u'}')
      if word.endswith(ending):
        l1 = len(word)
        l2 = len(ending)
        assert(l1 > l2)
        word = word[0:l1-l2]
        p = args.get(u'προθ')
        if p and word.startswith(p):
          word = word[len(p):]
        return word
    else:
      stem = find_stem(word, ending, args)
      if stem: return stem
  return None

def apply_pattern(stem, pattern, args, in_prefix=True):
  result = []
  delchars = int(args.get(u'χαρ', 1))
  if len(pattern) == 0: return [stem]
  char = pattern[0]
  if stem is None: return []
  if char in deaccent_letters:
    stem = deaccent(stem)
  if char == u'/':
    if in_prefix: stem = stem[1:]
    else: stem = stem[:-delchars]
  elif char == u'+':
    in_prefix = False
  elif char == u'-':
    in_prefix = False
  elif char == u')':
    pass
  elif char == u'(':
    result.append(stem + u'$')
  elif char == u'<' and u'συνίζ' in args:
    for _ in xrange(0, int(args[u'συνίζ'])+1):
      stem = accent_left(stem)
  elif char == u'<':
    stem = accent_left(stem)
  elif char == u'>':
    stem = accent_right(stem)
  elif char in u'123456':
    if char in args:
      stem = args[char]
    else: return [] #finish if missing stem reference
  elif char == u'}':
    pass
  elif char == u'{':
    until = pattern.index(u'}')
    var = pattern[1:until]
    val = u''
    if u'=' in var:
      varlist = var.split(u'=')
      var = varlist[0]
      val = varlist[1]
    if u'!' in var:
      var = var.replace(u'!', u'')
      result.extend(x for x in apply_pattern(u'', args.get(var, val), args, False) if x != u'')
    else:
      result.extend(x for x in apply_pattern(stem, args.get(var, val), args, False) if x != stem)
    pattern = pattern[until:]
    return [w for x in result for w in apply_pattern(x, pattern[1:], args, in_prefix)]
  elif char == u'S' and u'σ' in args:
    stem = stem[:-delchars] + args[u'σ']
  elif char == u'?':
    for c in merged_letters:
      if stem.endswith(c):
        stem = stem[:-2] + merged_letters[c]
  else:
    if len(stem) and stem[-1] == u'$':
      stem = stem[:-1]
    else:
      if in_prefix: stem = char + stem
      else: stem += char
  result.append(stem)
  return [w for x in result for w in apply_pattern(x, pattern[1:], args, in_prefix)]


def apply_patterns(stem, pattern, args):
  if pattern is None: return []
  if isinstance(pattern, basestring):
    words = [([], args.get(u'προθ', u'') + w) for w in apply_pattern(stem, pattern, args)]
    return words
  elif isinstance(pattern, dict):
    words = []
    for case in pattern:
      w = args.get(case, u'')
      if w != None and w != u'' and w != u'-':
        wl = (x.strip(u'[]() ') for x in w.split(u'/- '))
        words.extend(([case], x) for x in wl if x != '')
      else:
        props = declination_list_orders.get(case, [])
        for c, w in apply_patterns(stem, pattern[case], args):
          if len(c) and isinstance(c[-1], int):
            i = c[-1]
            if len(props) > i:
              del c[-1]
              c.extend(list(props[i]))
          c.append(case)
          p = (c, w)
          words.append(p)
    return words
  else:
    words = []
    for i, p in enumerate(pattern):
      for c, w in apply_patterns(stem, p, args):
        c.append(i)
        p = (c, w)
        words.append(p)
  return words


def split_sections(lines, depth=2):
  sections = {}
  lastsection = u'$top'
  sections[lastsection] = sections.get(lastsection, [])
  pattern = re.compile(r'^ *{} *([^{}]*) *{} *$'.format(u'='*depth, u'='*depth, u'='*depth))
  for line in lines:
    m = pattern.match(line)
    if m:
      if sections[lastsection] == []:
        del sections[lastsection]
      lastsection = m.group(1)
      sections[lastsection] = sections.get(lastsection, [])
    else:
      sections[lastsection].append(line)
  #for s in sections:
    #if s == u'$top': continue
    #sections[s] = split_sections(sections[s], depth+1)
  return sections

redirect_regexp = re.compile(u'#(?:REDIRECT|ΑΝΑΚΑΤΕΥΘΥΝΣΗ):? \[\[(.*)\]\]', re.I)
def get_redirect(text):
  m = redirect_regexp.search(text)
  return m.group(1) if m is not None else None

def parse_conj_args(result, args):
  for a in args:
    if u'=' in a:
      argparts = a.split('=')
      result[argparts[0]] = argparts[1]
  numargs = [x for x in args if u'=' not in x]
  for i in xrange(len(numargs)):
    if unicode(i+1) in result:
      print u'Args Conflict: {} {} {}'.format(i, result[unicode(i+1)], numargs[i]).encode('utf-8')
    result[unicode(i+1)] = numargs[i]
  return

conj_pattern_regexp = re.compile(u"\{\{el-κλίσ-'([^|']*)'([^\}]*)\}\}")
conj_pattern_generic_noun = re.compile(u'\{\{el-κλίσ-ουσ-ενπλ\|(.*)\}\}')
conj_generic_pattern = {
  u'Ουσ' : [
    u'{1!}',
    u'{2!}',
    u'{3!}',
    u'{4!}',
    u'{5!}',
    u'{6!}',
    u'{7!}',
    u'{8!}'
  ]
}
conj_pattern2_text = u"{{#invoke:Table-el-1|"
conj_pattern2_regexp = re.compile(u"\{\{#invoke:Table-el-1\|klisi[1-2]\|([^|]*)\|(.*)\}\}")

def get_conj_pattern(text):
  m = conj_pattern_regexp.search(text)
  if m is None: return None, None
  patternword = m.group(1)
  args = m.group(2)
  #print u'arguments to pattern: {} are {}'.format(patternword, args).encode('utf-8')
  argdict = {}
  if args: parse_conj_args(argdict, args.replace(u'(', u'').strip(' |').split('|'))
  for p in [noun_patterns, verb_patterns, adjective_patterns]:
    if patternword in p:
      pattern = p[patternword].copy()
      if u'process_args' in pattern:
        for f in pattern[u'process_args']:
          f(argdict, pattern)
        del pattern[u'process_args']
      for p in pattern.keys(): #ignore all optional patterns that were not switched on by args
        if u'=' in p:
          del pattern[p]
      return pattern, argdict
  #print u'Found referenced pattern: {}'.format(patternword).encode('utf-8')
  return None, None

def get_generic_pattern(text):
  m = conj_pattern_generic_noun.search(text)
  if m is None: return None, None
  args = m.group(1)
  #print u'arguments to pattern: {} are {}'.format(u'el-κλίσ-ουσ-ενπλ', args).encode('utf-8')
  argdict = {}
  if args: parse_conj_args(argdict, args.replace(u'(', u'').strip(' |').split('|'))
  return conj_generic_pattern, argdict
  

def get_pattern(text):
  if text is None: return None, None
  p, q = get_conj_pattern(text)
  if p is None:
    return get_generic_pattern(text)
  return p, q


conj_form_regexp = re.compile(u'^[*#].*(\{\{.*(?:πτώσ|ρημ τύπος).*\|)([^}]*)(\}\})')
single_line_link = re.compile(u'^ *\[\[([^]]*)\]\] *$')

# Build two dictionaries
# One forwards conj/decl to root form
# Other assigns POS tag
word_graph = defaultdict(list)
part_of_speech = defaultdict(list)

# this is a hack but it's ok for the way i'm using the graph.
def find_redirections(key, lines, depth=3):
  res = False
  for l in lines: # subsect[u'$top']:
    m = conj_form_regexp.search(l)
    if m:
      w = m.group(2)
      #print u'synonym: {} -> {}'.format(key, m.group(2)).encode('utf-8')
      if w not in word_graph[key]:
        word_graph[key].append(w)
      res = True
  return res
 
def handle_page(_, page):
  if u'title' not in page: return True
  key = page[u'title']
  if ":" in key or ' ' in key: return True
  text = page[u'revision'][u'text'].get('#text')
  if not text: return True
  found = False
  sections = split_sections(text.split('\n'))
  tgt = get_redirect(u''.join(text))
  if tgt and ':' not in tgt:
    #print u'{} -> {}'.format(key, tgt).encode('utf-8')
    if tgt not in word_graph[key]:
      word_graph[key].append(tgt)
    found = True
  if u'{{-el-}}' in sections:
    for text in sections[u'{{-el-}}']:
      pattern, argdict = get_pattern(text)
      words = []
      for pospattern in pos:
        if pospattern in text:
          #print u'{}({})'.format(pos[pospattern], key).encode('utf-8')
          part_of_speech[key].append(pos[pospattern])
      for pospattern in pos_cases:
        if pospattern in text:
          part_of_speech[key].extend(pos_cases[pospattern])
      if pattern is not None:
        stem = find_stem(key, pattern.values(), argdict)
        if not stem or stem == key:
          #print u"Guessing stem from key {} {}".format(key, stem).encode('utf-8')
          stem = key[:-1]
        words.extend(apply_patterns(stem, pattern, argdict))
        for c, w in words:
          c2 = [ x for x in c if isinstance(x, unicode) ]
          #print u'{} -> {} ({})'.format(w, key, u', '.join(c2)).encode('utf-8')
          if key not in word_graph[w]:
            word_graph[w].append(key)
          part_of_speech[w].append(c2)
          found = True
    found = found or find_redirections(key, sections[u'{{-el-}}'])
  if not found: # no pattern
    for c in greek_letters:
      if c in key:
        #print u'No pattern for lemma: {}'.format(key).encode('utf-8')
        break
  return True

if __name__ == u'__main__':
  parser = optparse.OptionParser(usage="Usage: %prog [options] el-wiktionary.xml")
  parser.add_option("-o", "--output", action="store", dest="output", default=u'word_graph.json', help="Where to store word graph.")
  (options, args) = parser.parse_args()
  if len(args) == 0:
    parser.print_help()
    sys.exit(1)
  with codecs.open(args[0], 'r', 'utf-8') as f:
    d = xmltodict.parse(f.read(), item_depth=2, item_callback=handle_page)
  with open(options.output, 'wb') as f:
    json.dump((word_graph, part_of_speech), f)




